[
{"rating": "4.0 out of 5 stars", "description": ["13MP+2MP dual camera and 16MP front facing camera", "14.83 centimeters (5.84-inch) multi-touch capacitive touchscreen with 2280 x 1080 pixels resolution 16M color support", "Memory, Storage & SIM: 4GB RAM | 64GB storage expandable up to 256GB| Dual SIM with dual standby (4G+4G)", "Android v8 Oreo operating system with 2.36GHz + 1.7GHz Kirin 659 octa core processor", "3000mAH lithium-polymer battery, SCREEN TYPE: TFT-LCD", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: Charger, USB Cable, Quick Start Guide, Warranty Card, Eject Tool, Protective Case"], "title": "Honor 9N (Blue, 4GB RAM, 64GB Storage)", "colour": "Blue", "brand": "Honor", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81erzw8RxDL._SL1500_.jpg"], "reviews": ["Except the front camera, there is nothing that is good about the mobile , charge doesn't stay for, the screen is too bad screen touch is bad, 128 gb space but still phone hangs several times, having issues to answer calls, waste of money....", "Nice pick under this price range. Finger Print Sensor and Face Unlock Feature are very fast and accurate. Even works in low light. Camera Quality is also very nice. Please go for the product. 5 Star from my side.", "All in all the phone is a good buy", "Pros:", "Excellent Picture quality,Resolution of mobile is charm with Notch display", "Sound Quality is fine considering location of speaker on device.", "Battery is the only Con for this as due to high resolution display and background app power consumption drainage is quick.", "Overall a good buy !!", "I purchased honor 9n 4 gb ram and 64 gb internal storage phone in rupees 8550 during the summer sale.", "Friends the camera a quality is very poor", "But it is a very good product and great value for money.", "Worst purchase ever..", "Actually I bought this phone during some offers n I guess they send me rejected device as the battery drains drastically without any usage n the phn gets heated up when connected to charging..", "Already complained the customer care they carried out some tests which are of no use..", "Im using it I can feel how it's heating n Al other issues but they from the other end says everything is ok..", "Worst purchase ever..", "Amazon loosing customers trust..", "I wish amazon understand this n provide me a refund..", "Do not support dual volte active standby. No updates also making this product obsolete. So no point in purchasing as the cheaper ones support that", "Hello All,", "If you are interested in Buying a Honor 9N this will be useful.", "I am writing this review after three days of usage.", "Size:", "The mobile is so handy, this is the first reason I preferred to buy this mobile. I do not like handsets that are huge sized.", "Camera:", "Front Facing camera does a wonderful job even under dim light condition compared to the price of the device.", "Rear facing camera struggles a lot to capture good shots even in bright light. I was using a Mi A1 before this may be this made me think in this way.", "Battery:", "So far so good, it lasted more than 24 hours with normal social media usage, I am not a pro user to check with games.", "Build Quality:", "Built Quality is excellent, gives us a premium feel.", "Fingerprint and Face-unlock", "Both works so good, the response time is comparatively less with the budget phones.", "Overall ratting would be 3.5/5.", "I will include comments later on if there is some issues. Stay Tuned.", "1.Battery charge losing fastly.", "2.Camera quality is excellent.", "3. Price s are different from diff merchants.", "Will get confused about its price ."], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/81erzw8RxDL._SL1500_.jpg", "path": "full/acfd0baedd0d9eccc6a5766a3194f4c2ac243950.jpg", "checksum": "1073a07ebcefc181ecbd4c8f80d3ef1f"}], "price": "₹ 8,499.00"},
{"rating": "4.2 out of 5 stars", "description": ["12MP+2MP dual rear camera | 32MP front facing camera", "15.9004 centimeters (6.26-inch) with 1520 x 720 pixels resolution, 269 ppi pixel density", "Memory, Storage and SIM: 3GB RAM | 32GB internal memory expandable up to 512GB | Dual SIM (nano+nano) dual-standby (4G+4G)", "Android Pie v9.0 operating system with 1.8GHz Qualcomm Snapdragon 632 octa core processor, Adreno 506", "4000mAH lithium-ion battery", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: Adapter, USB cable, warranty card, user guide, SIM insertion tool, back cover"], "title": "Redmi Y3 (Elegant Blue, 3GB RAM, 32MP Selfie Camera, 32GB Storage, 4000mAH Battery)", "colour": "Elegant Blue", "brand": "Redmi", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71L9IZiJB9L._SL1500_.jpg"], "reviews": ["This phone is best due selfie camera... Only the FHD+ is not available in this phone also Snapdragon 660AIE..But the selfie are quit better in this phone than note 7 ... I had given this phone as a gift to mom on her birthday cause she like this I do.. 😀", "google play store is not working, apps update stuck in download pending.", "even though high speed internet and settings in google play store fine.", "please any suggestion to fix this", "Average mobile but picture quality not satisfied....", "Nice phone camera is too good", "I have ordered this product on flash sale and  I thought I did good decision to buy it.but when I received it  was  having lot of unknown picture inside new phone , and voice in phone call was very low not able to hear, also phone is getting hanged and getting off, am very disappointed for this product, MI kindly contact me ASAP", "Planning to buy Redmi Y3? Read my review & decide yourself, if it satisfies your needs.", "Bought Redmi Y3 in First sale, sharing my experience as below:", "Front Camera(5/5)", "Rear Camera(4/5)", "Battery(5/5)", "Performance(4/5)", "Look(5/5)", "Pros:", "- FRONT CAMERA:", "==  Redmi Y series is known for Great Selfie Cams (to compete oppo/vivo ;)  ),Y3 won't disappoint you here, it captures great selfie pics, with natural colors,not extra beauty like oppo/vivo. Captures well details, for that just enable 32MP mode.", "== When clicking selfies in low light, screen gets light up to white to provide extra light.", "== Palm selfie mode: which also great feature, just show your palm in camera & it will click selfie in 3 seconds, useful while using selfie stick.", "== Front camera records video in 1080p with Electronic Image Stabilization, which is great part.", "- Rear camera performance is above average. It has EIS.", "- PERFORMANCE:", "  Snapdragon 632 Processor which gives good performance, but not best at this price.", "- BATTERY LIFE:", "  4000 mAh:  in moderate use which easily last for a day, In light usage, it lasts over a day and half. To charge from 0-100, it takes 2:30 hrs time.", "- IR Blaster.", "- Dedicated SD card support.", "- Gorilla Glass 5, LED notification.", "- Dual VoLTE.", "- Fingerprint is fast & responsive.", "- P2i water repellent coating: so it will save mobile from water splashes.", "- Gradient Blue with rainbow shade looks beautiful.", "Cons:", "- Under direct sunlight, screen looks dull, even with 100% brightness.", "- Plastic body.", "- Widevine level L3: no HD content streaming from Netflix/Amazon prime.", "- Ads ;) but you can turn it off, in setting, just turn off \"Show recommended content\".", "FINAL VERDICT:", "Buy Redmi Y3 only if, your primary need is selfie camera, other than that it is not great, little bit pricey.", "Xiaomi's Redmi Note 7 is far better than Redmi Y3 except front camera, which offers Snapdragon 660, 1080p screen resolution & other features.", "Bad software", "Phone hangs a lot", "Many issues and bugs in phone", "Only Battery and front camera is good", "Worst from MI", "iam completely satisfied with the features and the performance of the phone. Once again completely satisfied with the quality of the camera by Redmi. i really recommend all of you .of you can afford 10k, this is the best ever phone in that range. even vivo, oppo,asus cannot give this much camera quality even though those are higher MP quality camera than this one."], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71L9IZiJB9L._SL1500_.jpg", "path": "full/7ebff436bc3b059981799241cc0de8d340dcaeb1.jpg", "checksum": "a29161bc13f5f3dd072db115abeecc18"}], "price": "₹ 7,999.00"},
{"rating": "4.0 out of 5 stars", "description": ["13MP+5MP ultra-wide angle dual camera | 5MP f2.0 front camera. The internet usage time is 15 hours for 3G as well as 19 hours for LTE.The video playback time is 17 hours and audio playback time is 84 hours", "15.8cm (6.22\") HD+ Infinity V Display with 90% screen ratio", "3GB RAM and 32GB internal memory expandable up to 512GB in a dedicated slot", "Fast face unlock | 3400 mAh lithium-ion battery", "Dual SIM (nano+nano) with dual standby and dual VoLTE", "1.6GHz Exynos 7870 octa-core processor | Android Oreo v8.1 OS", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase"], "title": "Samsung Galaxy M10 (Ocean Blue , 3GB RAM, 32GB Storage)", "colour": "Ocean Blue", "brand": "Samsung", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/613Os2k0a2L._SL1500_.jpg"], "reviews": [" Well, I was a bit sceptical before buying this Samsung Galaxy M10, so", "I bought this", "phone on the second sale & placed the order for the variant ie", "3GB+32GB for ₹8990. Here is the detailed review of this device with", "pros and cons ratings. Few camera samples are also attached to this", "review.", "Pros:-", "1) Very lightweight", "2) It looks beautiful and has a huge display", "3) Nice crisp display", "4) The infinity V display looks great", "5) Ultra Wide dual rear camera", "6) Dedicated Micro SD card slot", "7) No heating issues", "8) Face unlock works smoothly", "Cons:-", "1) The rear camera is worse", "2) The back panel of the phone is not that good", "3) It is not having fast charging support as it is having a USB port.", "4) No Fingerprint scanner", "5) Only 2.4Ghz Wifi Support", "6) Not a PUBG Phone", "7) Bloatware (Though we can disable them)", "8) Bigger bottom bezel than M20", "9) 1Amp Charger in the box", "Ratings:-", "Design: 7/10", "Display: 9.5/10", "Battery: 7/10", "Back camera: 6/10", "Front Camera: 7/10", "Processor: 7/10", "Call Quality: 8/10", "Face unlock & Fingerprint: 7/10", "Speakers: 8/10", "Pricing: 8.5/10", "Now let's come to the detailed review:-", "# Box contents:- In the box, you will get the handset, Charging", "adapter, USB cable, Sim ejector tool and user manual.", "# Design:- The design of M10 is great and I bought the black variant,", "it looks beautiful in hand and as I said earlier it is an attention", "grabber.", "# Build Quality:- It is fully made up of plastic & and the back side", "of the phone is having plastic finishing but it is polycarbonate and", "it is very prone to scratches. I will suggest you buy a back cover.", "# Display:- It is having 16CM (6.3) FHD+ Dewdrop full view display,", "with broad 90.8% screen-to-body ratio, 19.5:9 aspect ratio, and 2.5D", "Gorilla Glass, it gives the screen a premium look. The bezels are less", "and the bottom chin is quite very thin which makes the viewing best. The", "viewing experience is great and in sunlight the screen is visible.", "# Battery:- It is loaded with 3400 mAh battery, if you are a moderate", "user, it can give you the battery backup for around 1 day or more and", "if you a gamer (playing high-end games) it can give you a backup for", "whole day.", "* I have charged this phone from 20% to 100% the time taken was 2", "hours 20 minutes.", "# Audio:- The speaker of this phone is very crisp and clear. The audio", "through the earphones are just WOW and you will also get an opinion", "for the Equalizer in the phone settings.", "# Performance:- The M10 runs on 1.6 GHz Exynos 7904 octa-core", "processor. All the high-end games like PUBG, Asphalt 9, Unkilled runs", "average. You cant get winner chicken dinner with this phone", "easily.", "# Camera:- It is having selfie-5 MP front camera and the rear camera", "is having 13 MP+5 MP ultra-wide angle dual camera. The front camera works", "best under natural lighting conditions, but the rear camera struggles a", "lot in low light conditions. (I have attached a few camera samples)", "# Security:- The face unlock is not that fast and we should be as well worried about the security, I've seen few videos on Youtube where users have by-passed it.", "# Connectivity:- It supports 4G LTE connectivity and in the WiFi, it", "supports 2.4GHz routers if you are having a 5GHz router then this", "the phone will not support the frequency (Attached a screenshot and video)", "# Pricing:- The pricing of M10 starts for ₹7990 ie for the base", "variant (2GB + 16GB) and the other variant ie (3GB + 32 GB) is priced", "for ₹8990. If you are looking for a budget smartphone for less than ₹9000 then I will recommend you to go for the 3+32 variant of the Samsung Galaxy", "M10.", "#SUMMARY:-", "If you are in a very tight budget with ₹9000 then I will definitely", "recommend you to buy the 3+32 GB variant of the Samsung Galaxy M10", "because at this price point it offers you good performance(NOT FOR", "HARDCORE GAMING ONLY FOR MODERATE USAGE AND MODERATE GAMING), an okayish build & looks, crisp and clear screen, loud & crisp speakers, a decent dual rear camera and a decent front camera. If you want a good phone with gaming at a budget price range then don’t go for this phone.", "This phone gives a very nice completion to the many phones out there in", "the market like Redmi 6, Redmi 6 pro, etc.", "I hope my review was helpful!", "It's a worthless phone with only dislikes. The product is not up to the mark, the built quality, the resolution and the best part is the the camera is even worse. The dual camera is for name sake and you end up having pathetic pictures. It's best to have some different category phone for the same price brand rather than going for M10.", "Also please note Amazon is not providing any service to return the product. They are just over promoting and overhyped the product to  catch the customers in the  net. Once it's sold as per them, they can't help.", "Crux of the story from my side is don't go for it.", "Ordered this product in the First Sale. And i have to say samsung has done a really good job in the budget segment. Phone Doesnt look or feel cheap.", "Pros:-", "1. price is really competetive with Samsung Branding", "2. Battery Life is Good", "3. Screen Looks Great with hd+ Resolution", "4. front Camera Is good enought for selfies", "5. phone is light weight", "Cons :-", "1. Rear Camera is not that great. But still u get a ultra wide lens at entry level smart phone", "2. No headphones included", "3. Low internal Storage at base model", "At price of 7990 its a great phone. I just bought this to  review.. U should go with atleast 32gb Model its more practical in daily life. Phone Works Great in day to day life. exysnos 7870 is good enough to  handle daily tasks.. and Samsung Experience 9.5 feels snappy.", "Technoholic Life", " Don't buy this phone. Because phone itself switching off automatically. This phone not switching on please watch the video", "Well phone is quite nice in look.", "Battery performance is excellent.", "Samsung did really good job in theme .", "Phone should have an internal app lock as i think", "Pros:", "1 . Display  touch response is excellent.", "2 . Wide angle camera is quite impressive.", "3. Batter backup is great .", "4. Phone runs smooth.", "5. Boot time is fast", "Cons :", "1. No led light for notification and charging.", "2. No time lapse and hdr mode in camera", "3. Face lock is slow and might work too late in less lighted area.", "4. Pubg is quite slow in these phone but can play in low settings..", "5. Front camera is shakky sometimes.", "There is nothing special about this phone except big screen.", "1. Camera experience is worst ever compared to other phones in this range.", "2. Poor body build.", "3. You Tube videos shows blur, even you play HD videos .", "4. Backup is not up to the mark. It takes almost 3.5 hrs to recharge.", "5. I strongly recommend not to buy this Samsung M10 and even Amazon return policies are worst. So think read all T&C before going with this product.", "Excellent Phone in this budget. I've gifted it to someone. She likes it very much. Ocean color is awesome. Performance is also very good. Light weighted. Handy Phone.", "Amazing mobile for best price happy with product"], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/613Os2k0a2L._SL1500_.jpg", "path": "full/9095a2873a676586b8da4faf926b46ffaaf45d34.jpg", "checksum": "a4cfb99edb8bafd80a08805c3fc22a6a"}], "price": "₹ 7,999.00"},
{"rating": "4.3 out of 5 stars", "description": ["To avail No Cost EMI benefits, on part or all of the products in your order, please add the items individually to your cart and continue to the checkout process", "16.15 centimeters (6.35-inch) halo fullview display with 720 x 1544 pixels resolution", "Memory, Storage & SIM: 3GB RAM | 32GB internal memory expandable up to 256GB | Dual SIM (nano+nano) dual-standby (4G+4G)", "Android Pie v9.0 operating system with Qualcomm Snapdragon 665AIE octa core processor", "5000mAh lithium_ion battery with 18W fast charging", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: User manual, micro USB to USB cable, USB power, adapter, SIM ejector pin and protective case"], "title": "Vivo U10 (Thunder Black, 5000 mAH 18W Fast Charge, 3GB RAM, 32GB Storage)", "colour": "Thunder Black", "brand": "Vivo", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/516oSqq8abL._SL1200_.jpg"], "reviews": ["Nice looking and very nice phone", " Battery is good and ... camera is good", "Nice phone under 9000", "Vivio U 10 is a descent  phone it has some pro and Con", "Pros:", "i) Great Battery Backup", "ii) Faster app opening", "iii)Good Multitasking", "Cons:", "i) Poor Camera, No Portrait option in Front camera", "ii) Too many notification", "iii)cant uninstall app from screen directly", "you have to go app settings option.", "Its a awesome phone for this price range.", "Fully loaded.Go for it !!", "Go for 64GB , 4GB variant", "Nice", "amazing deal in this brand with huge number of feature...", "Even better phone in this range if you not go to it's camera", "Battery 5000 mAh is cherry on cake and all the function in this phone which you get in others phone cost of 15k and above", "Ultimate phone at this price."], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/516oSqq8abL._SL1200_.jpg", "path": "full/f7026d1174dfb29cc2d18677e5aad8256300cff9.jpg", "checksum": "d7dfdb00ace99e77056322a47af64018"}], "price": "₹ 8,990.00"},
{"rating": "3.6 out of 5 stars", "description": ["12MP rear camera with large 1.25μm pixels | 5MP front camera", "13.84 centimeters (5.45 inch) HD+ full screen display with 1440 x 720 pixels resolution", "Memory, Storage & SIM: 2GB RAM | 16GB internal memory expandable up to 256GB | Dual SIM (nano+nano) dual-standby (4G+4G)", "Android Pie v9.0 operating system with 2.0Ghz Snapdragon 439 octa core processor with 12nm FinFET technology", "4000mAH lithium-polymer battery", "2 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also Includes: Power adapter, USB cable, SIM eject tool, warranty card and user guide"], "title": "Redmi 7A (Matte Black, 2GB RAM, 32GB Storage)", "colour": "Matte Black", "brand": "Redmi", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71YK3AQN02L._SL1500_.jpg"], "reviews": ["The 7A is nothing extraordinary to look at but neither is it ugly.You'll find all the basics like a practical design, curved back, front + rear cameras and 3.5mm audio jack.", "Good qualities:Smooth performance, triple card slot, fast face unlock, wireless FM (no headset needed) + FM recording, large battery, great camera (esp. for the segment), matte finish polycarbonate back panel, splash resistant P2i coating.", "Bad qualities:No fingerprint unlock, skips the IR emitter port, supports 10W charging but only 5W charger included.", "Value of money 8", "Performance 6", "Mobile is not  doing good work", "OK for this amount", "Servec not good", "Product is good but The cover didn't come along", "Some times double tap screen light on not working... There is no option to crop select on while taking screen shot.... There is no VR mode... Remaining all good", "When u are not using the phone for 30-40 minutes  the double tap to wake up phone does not work properly & same problem with face unlock feature. Plz help", "Charging very slow"], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71YK3AQN02L._SL1500_.jpg", "path": "full/2f23b250a2b1978f877ee06677f4b3d4f5fb6058.jpg", "checksum": "80c9732b6b1e85e8af771eb82be04f51"}], "price": "₹ 5,799.00"},
{"rating": "Previous page of related Sponsored Products", "description": ["13MP + 5MP primary camera | 8MP front facing camera", "16.21 centimeters (6.4-inch) HD+ capacitive touchscreen with 720 x 1560 pixels resolution 16M color support", "Memory, Storage & SIM: 3GB RAM | 32GB storage expandable up to 512GB | Dual nano SIM with dual standby (4G+4G)", "Android v9.0 Pie operating system with 1.6 GHz + 1.35 GHz Exynos 7884B octa core processor", "4000mAH lithium-ion battery with fast charging | 15W Type-C fast charger in the box", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: Travel Adapter, USB Cable, Ejection Pin, User Manual"], "title": "Samsung Galaxy M10s (Stainless Black, 3GB RAM, Super AMOLED Display, 32GB Storage, 4000mAH Battery)", "colour": "Stainless Black", "brand": "Samsung", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71vZUidoQ7L._SL1500_.jpg"], "reviews": [], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71vZUidoQ7L._SL1500_.jpg", "path": "full/78907be0e703035a7a507dade24e960949c4e59b.jpg", "checksum": "17b5f99a88d6aca626a7569f6d30511f"}], "price": "₹ 8,999.00"},
{"rating": "4.1 out of 5 stars", "description": ["To avail No Cost EMI benefits, on part or all of the products in your order, please add the items individually to your cart and continue to the checkout process", "16.15 centimeters (6.35-inch) halo fullview display with 720 x 1544 pixels resolution", "Memory, Storage & SIM: 3GB RAM | 64GB internal memory expandable up to 256GB | Dual SIM (nano+nano) dual-standby (4G+4G)", "Android Pie v9.0 operating system with Qualcomm Snapdragon 665AIE octa core processor", "5000mAh lithium_ion battery with 18W fast charging", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: User manual, micro USB to USB cable, USB power, adapter, SIM ejector pin and protective case"], "title": "Vivo U10 (Thunder Black, 5000 mAH 18W Fast Charge, 3GB RAM, 64GB Storage)", "colour": "Thunder Black", "brand": "Vivo", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/516oSqq8abL._SL1200_.jpg"], "reviews": ["Nice looking and very nice phone", " Battery is good and ... camera is good", "Nice phone under 9000", "Vivio U 10 is a descent  phone it has some pro and Con", "Pros:", "i) Great Battery Backup", "ii) Faster app opening", "iii)Good Multitasking", "Cons:", "i) Poor Camera, No Portrait option in Front camera", "ii) Too many notification", "iii)cant uninstall app from screen directly", "you have to go app settings option.", "Its a awesome phone for this price range.", "Fully loaded.Go for it !!", "Go for 64GB , 4GB variant", "Nice", "amazing deal in this brand with huge number of feature...", "Even better phone in this range if you not go to it's camera", "Battery 5000 mAh is cherry on cake and all the function in this phone which you get in others phone cost of 15k and above", "Ultimate phone at this price."], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/516oSqq8abL._SL1200_.jpg", "path": "full/f7026d1174dfb29cc2d18677e5aad8256300cff9.jpg", "checksum": "d7dfdb00ace99e77056322a47af64018"}], "price": "₹ 9,990.00"},
{"rating": "3.9 out of 5 stars", "description": ["48MP + 8MP + 5MP triple rear camera | 16MP front facing camera", "16.21 centimeters (6.4-inch) FHD+ capacitive touchscreen with 2340 x 1080 pixels resolution 16M color support", "Memory, Storage & SIM: 4GB RAM | 64GB storage expandable up to 512GB | Dual nano SIM with dual standby (4G+4G)", "Android v9.0 Pie operating system with 2.3GHz + 1.7GHz Exynos 9611 octa core processor", "6000mAH lithium-ion battery with fast charging | 15W Type-C fast charger in the box", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: Travel Adapter, USB Cable, Ejection Pin, User Manual"], "title": "Samsung Galaxy M30s (Opal Black, 4GB RAM, Super AMOLED Display, 64GB Storage, 6000mAH Battery)", "colour": "Opal Black", "brand": "Samsung", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71p2%2B%2B3ufvL._SL1500_.jpg"], "reviews": ["Simply fabulous deal....Complete budget phone with all what u need.", "1. Good camera- Yes ( wide angle, depth)", "2. Battery- Yes", "3. User Experience -thumbsup..", "4. Looks premium.", "5. Simply amazing.", "6. Good Brand- Yes", "7. synchronized- Well will now after 7 days of usage.", "6. Processor Good..", "7. Customer service is a plus point ofcourse.", "8. It's \"The best deal\" in this price segment.", "Must buy....", "Front Camera should be little better remaining all features are EXCELLENT!!!", "Delivered within 24 hours.", "Looks awesome.", "Battery was 49% when I switched on..and after 2 hours of continuous use it is 42% now.", "Camera is awesome.", "Sound is loud.", "Display is amazing.", "Mine is Opal black one.", "Amazon is always great compare to flipkart. Awesome service. Well Samsung M30s is no surprise is a lovely phone packed with all amazing features and monster battery back up. Looks good feels like magic", " I am adding video of unboxing this mobile. A only amazon is selling this mobile in great indian sale.", "Best part of this mobile is you ar not able to get any cheaper that this mobile for this configuration.", "Only one thing which I don't like in this mobile is it's little heavier than other Samsung mobile and also size is little big which is not user friendly.", "Excellent mobile for low cost and advanced features like display quality and great  sound system Dolby atoms. I like very much. Camera quality is also extremely high with this range.  The UI and all the new enhancing animations and icons extremely looking awesome. I can  give  5 out of 5", "Built quality is poor. Front camera is worst. Back camera doesn't look like 48megapixel. The product which I received has a back panel issue. Don't buy pearl white.", "Wonderful phone at such a reasonable price . The only drawback is that there aare no earphones with the phone , otherwise the phone is great, with wonderful speed to start with  lovely display"], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71p2%2B%2B3ufvL._SL1500_.jpg", "path": "full/a8d1e8937a57620d057625c0089f61ee5dcfbd0a.jpg", "checksum": "8a4b4d2727a2742d038b3315b7404eb7"}], "price": "₹ 13,999.00"},
{"rating": "3.7 out of 5 stars", "description": ["16MP+5MP rear camera | 16MP front facing camera", "14.732 centimeters (5.8-inch) with 1080 x 2280 pixels resolution", "Memory, Storage and SIM: 6GB RAM | 64GB internal memory | Expandable to 400 GB |Dual SIM dual-standby (4G+4G)", "Android v8 Oreo operating system with Qualcomm Snapdragon SD 636 quad core processor", "3060mAH lithium-ion battery", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box includes: Charger and Data cable"], "title": "Nokia 6.1 Plus (Black, 6GB RAM, 64GB Storage)", "colour": "Black", "brand": "Nokia", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61UXDdyLTxL._SL1100_.jpg"], "reviews": ["Build Quality is Very Premium looking.", "Compact Design. Fingerprint Sensor very Fast responsive.", "Camera Performance Decent.", "6+64 GB variant already updated Android Pie 9", "Nice Experience 👍🏻👍🏻👍🏻", "Camera not up to mark", "No worry Happy with your  Purchase and good brand quality", "Very good product. I have used almost every brand the last 4 or 5 years but at Last I feel myself \"I'm back to my home after a very long journey\". Best built quality, best camera(but use gcam), very nice design, perfect size, nice display, very good performance. Snapdragon 636 from nokia is far faster n better in all respect than a Snapdragon 660AIE processor of Xiaomi mi à2 or Redmi note 7s or 7. I use both these phones and I'm talking exactly what I experience practically in real life. Moreover the 48mp camera from redmi note 7pro is incomparable with Nokia's 16mp while using Gcam. Even older Nokia 6.1(non plus model) beats the camera of note 7 pro both front and rear. I suggest don't even hope to bring note7 pro's gimmick 48mp near nokia 6.1plus. Everything is perfect with this phone. But the battery life will be a deal breaker for many of the our youths as they will charge twice a day(PUBG!!!!). That's why I'm reducing one 🌟. But for me it's quite easy to manage for one day usage as I previously use iPhone 7. I don't know why many costumers  in amazon are ruining this very good phone. They have made change many people's minds so that they(many people) left this Nokia 6.1plus from the best seller (Apario) of amazon for an alternative phone. I suggest this phone to everyone. Don't go wrong, don't trust these ill reviews and comments. Just buy and try one you won't feel repentant.", "Best mobile in that price", "There was a stock Android and there", "Package headphone in that", "All over. Mobile was best", "Nokia should just shut shop now. Going to return this piece of crap", "Very good performance and happy with this purchase. 🙂🙂🙂", "I got it for 11999 on prime day it worths more than that, lovely camera and performance no doubt with sd636 and too good ram management,I dont know why some people are not liking it but its damn good"], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/61UXDdyLTxL._SL1100_.jpg", "path": "full/1a9985acfda8fdec764c852bd8646e644913f1ff.jpg", "checksum": "f36b7bde004f801d2ff51570963d243b"}], "price": "₹ 9,999.00"},
{"rating": "3.6 out of 5 stars", "description": ["12MP rear camera with large 1.25μm pixels | 5MP front camera", "13.84 centimeters (5.45 inch) HD+ full screen display with 1440 x 720 pixels resolution", "Memory, Storage & SIM: 2GB RAM | 16GB internal memory expandable up to 256GB | Dual SIM (nano+nano) dual-standby (4G+4G)", "Android Pie v9.0 operating system with 2.0Ghz Snapdragon 439 octa core processor with 12nm FinFET technology", "4000mAH lithium-polymer battery", "2 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also Includes: Power adapter, USB cable, SIM eject tool, warranty card and user guide"], "title": "Redmi 7A (Matte Black, 2GB RAM, 16GB Storage)", "colour": "Matte Black", "brand": "Redmi", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71YK3AQN02L._SL1500_.jpg"], "reviews": ["The 7A is nothing extraordinary to look at but neither is it ugly.You'll find all the basics like a practical design, curved back, front + rear cameras and 3.5mm audio jack.", "Good qualities:Smooth performance, triple card slot, fast face unlock, wireless FM (no headset needed) + FM recording, large battery, great camera (esp. for the segment), matte finish polycarbonate back panel, splash resistant P2i coating.", "Bad qualities:No fingerprint unlock, skips the IR emitter port, supports 10W charging but only 5W charger included.", "Value of money 8", "Performance 6", "Mobile is not  doing good work", "OK for this amount", "Servec not good", "Product is good but The cover didn't come along", "Some times double tap screen light on not working... There is no option to crop select on while taking screen shot.... There is no VR mode... Remaining all good", "When u are not using the phone for 30-40 minutes  the double tap to wake up phone does not work properly & same problem with face unlock feature. Plz help", "Charging very slow"], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71YK3AQN02L._SL1500_.jpg", "path": "full/2f23b250a2b1978f877ee06677f4b3d4f5fb6058.jpg", "checksum": "80c9732b6b1e85e8af771eb82be04f51"}], "price": "₹ 4,999.00"},
{"rating": "3.6 out of 5 stars", "description": ["12MP rear camera with large 1.25μm pixels | 5MP front camera", "13.84 centimeters (5.45 inch) HD+ full screen display with 1440 x 720 pixels resolution", "Memory, Storage & SIM: 2GB RAM | 16GB internal memory expandable up to 256GB | Dual SIM (nano+nano) dual-standby (4G+4G)", "Android Pie v9.0 operating system with 2.0Ghz Snapdragon 439 octa core processor with 12nm FinFET technology", "4000mAH lithium-polymer battery", "2 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also Includes: Power adapter, USB cable, SIM eject tool, warranty card and user guide"], "title": "Redmi 7A (Matte Blue, 2GB RAM, 32GB Storage)", "colour": "Matte Blue", "brand": "Redmi", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/71CyW7YCRaL._SL1500_.jpg"], "reviews": ["The 7A is nothing extraordinary to look at but neither is it ugly.You'll find all the basics like a practical design, curved back, front + rear cameras and 3.5mm audio jack.", "Good qualities:Smooth performance, triple card slot, fast face unlock, wireless FM (no headset needed) + FM recording, large battery, great camera (esp. for the segment), matte finish polycarbonate back panel, splash resistant P2i coating.", "Bad qualities:No fingerprint unlock, skips the IR emitter port, supports 10W charging but only 5W charger included.", "Value of money 8", "Performance 6", "Mobile is not  doing good work", "OK for this amount", "Servec not good", "Product is good but The cover didn't come along", "Some times double tap screen light on not working... There is no option to crop select on while taking screen shot.... There is no VR mode... Remaining all good", "When u are not using the phone for 30-40 minutes  the double tap to wake up phone does not work properly & same problem with face unlock feature. Plz help", "Charging very slow"], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/71CyW7YCRaL._SL1500_.jpg", "path": "full/56115cced7a0328b600245309830821f2c589b9e.jpg", "checksum": "3ec86cc4ea13a1bed07da6f88782cc00"}], "price": "₹ 5,799.00"},
{"rating": "3.6 out of 5 stars", "description": ["PACKAGE CONTENTS : Mobile, Battery, Charger, User Mannual", "Internal memory- 16GB which can be expandable upto 32GB through SD card, RAM- 2GB .Video screen: Video records with sound, WIFI:802.11 b/g/n, Battery 2500 mAH", "5.45 Inch IPS Display Dual Sim, CAMERA- 5MP Primary camera, 2MP Secondary or front camera. 4G VOLTE CALLING.GPRS Supported", "Operating System- Android 6.0 (Marshmallow) Frquency band: WCDMA 2100/ (HSDPA) and GSM 850/900/1800/1900/4G(B3/B5/B40)", "1 year warranty on the product for which customer can reach to nearby service center or can call our customer care at: 0120-4731048 or mail your query us at: helpdeskcustomercare09@gmail.com"], "title": "I Kall K3 Plus 5.45 Inch Display Dual Sim 4G Android Mobile (2GB Ram, 16GB Storage)", "colour": "not defined", "brand": "IKALL", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61JchiY0e1L._SL1100_.jpg"], "reviews": ["Average", "When charging mobail too heated. Sound not working properly", "Small money big product I enjoy it", "I like for its feature", "the phone will work properly for 1 week ,and after that it will cause the storage ISSUE .if you uninstall all the apps still the issue continues ,the phones with 1gb ,ram and 8gb internal storage are working better than this.They are closing return option in 1 week because they know cache problem of storage will occur in 5-10 days", "according to price its good for first android users as it provides all features but it has a low storage space plz increa", "se it"], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/61JchiY0e1L._SL1100_.jpg", "path": "full/62f31b97303af2fdb97604ba51aed5243484b0c4.jpg", "checksum": "3bb39f9234cb3e10f37997f8158a1d86"}], "price": "₹ 3,899.00"},
{"rating": "Previous page of related Sponsored Products", "description": ["K7 Features :- 6 Inch IPS Display II 2GB Ram & 16GB Internal Memory || 5MP Rear and 2MP Front Camera", "K28 Mobile Features:- 2.4 Inch Colour Display II Dual Sim Standby (Sim Size :- Full Sim) || Full Multimedia (MP3, Video Player, FM, Auto Call Recording) || Torch Light", "Box Content :- 2 Mobiles, 2 Batteries, 2 Charger", "1 Year Manufacturing Warranty For Both Mobile & 6 Months For Both Mobile Box Accessories", "2000 Plus Service Centre All Over India II Customer Care Number 0120-4731048 or reach us at helpdesk@ikall.in"], "title": "I Kall K7 Smartphone with Free K28 Feature Phone", "colour": "not defined", "brand": "IKALL", "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61wKzOReZrL._SL1100_.jpg"], "reviews": [], "instock": true, "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/61wKzOReZrL._SL1100_.jpg", "path": "full/4b3a5f01b3960704eaba2b5ff48d3718abfb82de.jpg", "checksum": "dd158e3c7c00d37eac94d63efdb6ce9a"}], "price": "₹ 4,699.00"}
]