[
{"title": "Coolpad Cool 3 (2GB RAM, 16GB Storage) (Midnight Blue)", "brand": "Coolpad", "rating": "3.1 out of 5 stars", "price": "5,969.00", "colour": "Midnight Blue", "instock": true, "reviews": ["Please dont buy this item", "Camera Good at Rs 6000 it is 8megapixel. You have to adjust.", "Design superb people will like it", "Battery Good", "Price must be reduced to Rs 4500 in order to be number one selling phone in India.", "Best budget photo", "I like it", "i like this phone but i had to return it after 8 days using it, because then microphone wasn't working properly.", "Phone getting switch off automatically.what to do now", "Great product at this price ,premimum look and feel", "Product Design and looking is very good.", "Compare to price it's value for money.", "Beyond that mobile has poor camera clarity.", "Sim tray damaged when I first time use only.", "Looking good but quality not maintained."], "description": ["14.48 cm (5.7 Inch) HD+ Dewdrop Notch Display.", "2GB RAM|16GB ROM|Expandable upto 128GB.", "1.6Ghz Octa-core Processor |Android 9.0(Pie)", "8MP+0.3MP Dual Rear Camera|5MP Front Selfie Camera", "3000 mAh Battery|Dual Sim 4G Volte Support"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61L6KElKlML._SL1000_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/61L6KElKlML._SL1000_.jpg", "path": "full/3775701374e10aece44fc04c11460845b6e2ba1b.jpg", "checksum": "e541f2e6756d08bb8fd384ac59da1b9e"}]},
{"title": "OPPO F11 Pro (Thunder Black, 6GB RAM, 128GB Storage) with Offer", "brand": "Oppo", "rating": "4.3 out of 5 stars", "price": "23,780.00", "colour": "Thunder Black", "instock": true, "reviews": ["First of all thanks to OPPO for making this wonderful device. The design at its best and better than Vivo V15 pro. I checked V15 pro at the stores and for some reason I didn't like it, may be the build quality looked too plasticky and saturated display. So waited for F11 pro and its worth a wait. Let me list out all the pros and cons after 1 week of usage.", "Pros:", "1. Build Quality: This first thing we witness in a phone is the build. Trust me, oppo has cut corners but have made sure it has that premium feel. Though the back is polycarbonate plastic, with some process they have made it look like a glass panel. Little slippery but easy and comfortable to hold. Phone has got some weight because of that huge battery, but because of the weight it gives us a metal glass feeling when we hold. All the keys are in good position and again no plastic feel at all.", "2. Display: I hate notch and all those tear drop or water drop things. F11 pro with the panoramic screen is an absolute treat to watch. Its just fantastic and mesmerizing whenever we hold and touch it, a butter smooth experience. Screen is bright enough even in outdoor conditions and very colorful. If you like bigger display this is the phone. Again this is better than V15 pro.", "3. Camera: In an oppo shared article I read the sensor used in oppo f11 pro is the same Sony sensor IMX586 which they used in Redmi Note 7 pro. Looks like the news is for real. Camera quality from rear and front is top notch. Natural colors, Outstanding details, Perfect HDR shots and a easy friendly camera UI. The pop-up camera technology is too good to see. Its fast and works quietly.", "4. Battery: No problems with the battery, it comes more than a day. No drain at all.", "5.Charging: When f11 pro was released there was a con which was discussed widespread is about the micro USB port and not Type C. Now I'm going to add this in the pros here. Because the VOOC technology is just awesome.Its just super fast charging. When I received the phone it was around 20% battery, when I charged using VOOC within less than 30 mins it was full charged. When you switch off and charge its even more faster.", "6. Performance: We have seen this P70 chipset in many phones earlier. One of the fastest and it performs well here too. No lags at all during normal usage and also it can handle any game you throw at it. Have no complaints at all on performance. Oppo has designed it perfectly", "7. Sound: Sound quality from the bottom speaker is above average. But that doesn't mean its bad. Its perfect sound quality, good form media activities and games too. Earpiece receiver is very loud and too crisp and clear. Cellular call quality at its best.", "8. Network: WiFi and data connectivity works perfectly without any drop and the reception performance is top notch.", "9. Face lock is super fast and finger print is faster as well", "10. Color OS 6 on F11 pro and I kind of like it. They have improved lot of things and many features added as well. Stock UI lovers better stay away from this phone. But trust me Color OS works like a charm. Already got two security updates. No complaints at all.", "Cons:", "1.Phone is premium no doubt about it and super fast performance. Its a must buy phone and I will suggest this over Vivo V15 pro. But with the P70 processor this should be between the price range 20k to 21k.", "2.The storage limit it should be 128GB for a 6GB RAM and not 64GB. Also this is a hybrid slot where there is no place for SD card when we use two sims. Oppo should have considered three slots when they have decided to go for a 64GB storage limit.", "Just those two cons, but again this is a beast and a must buy. Like I said its little expensive but in online markets you have this exchange offers and bank discounts where we can bring the price down. So go for it guys, you won't regret.", "I love this phone thank you amazon and Oppo team for F11 pro.", "I have one issue with phone :", "My phone is getting heated while calling (for more than 15-20 min. talk) please suggest me and if any one facing this same issue so please reply...", "Terrific purchase.. got heavy exchange value for my old phone.", "Pros", "- Superb camera, night light camera is amazing...", "- Vooc charging (10% to 100% charging in just 30 mins.", "- iPhone type headset.", "- Full view display", "- Andriod pie features", "No cons till now..", "Good mobile very nice thank you oppo", "I am Full happy dis moble camera v v v good super  super", "I didnt got free bluetooth speaker and selfie stick what is this", "Very Nice Phone. Nice colour and Design. 6.5 inch screen makes a great viewing experience for movies and game's specialy PUBG😍😍. Super fast Charging. Full Charge in just 1.5 Hrs. But memory need to be 128 GB for this price range.", "Camera quality is superb.", "Awesome phone compare to that price range..", "Rear Camera quality - 5/5", "Front camera quality -4/5", "Sound quality -2.5/5", "Headphone output quality -2.5/5", "Processor speed -4/5", "Battery backup -5/5", "Design -5/5", "Charging speed -4/5", "Build quality -4/5", "Cons:", "Little heavy (OK for me)", "Phone is slippery..", "Overall : 4/5", "Best phone under 25k", "1 Week use Detailed Review", "No problem on the phone yet", "Pros-", "Back Camera,Night mode,Slo-Mo,Video, Portrait Mode,etc are excellent", "Front Camera is perfect", "The pop-up design is awesome and eye catching", "The color(Aurora Green) is extremely beautiful and attractive", "The battery life is amazing and VOOC 3.0 Is superb", "Does not get heated up even after an extreme use", "Mediatek Helio P70 is perfect and fast", "Overall A perfect Phone", "Cons-", "Plastic Back", "Front Portrait fades away sometime", "Internal memory should have been 128gb at this price segment or there should have been a dedicated slot for memory card", "Overall if you can avoid all this cons(I think this Cons wont make a much difference)", "Oppo F11 Pro is perfect for you Go for Itt"], "description": ["48MP+5MP dual rear camera with normal, video, expert, time-lapse, panorama, portrait, slow-motion | 16MP front camera", "16.58 centimeters (6.5-inch) FHD+ multi-touch capacitive touchscreen with 2340 x 1080 pixels resolution, 397 ppi pixel density", "Memory, Storage and SIM: 6GB RAM | 128GB internal memory expandable up to 256GB | ual SIM (nano+nano) dual-standby (4G+4G)", "Android ColorOS 6.0 operating system with 2.1GHz MediaTek Helio P70 octa core processor, ARM Mali G72", "4000mAH lithium-polymer battery providing talk-time of 36 hours and standby time of 360 hours", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: VOOC Charge Adapter, Earphone, USB Cable, Sim Tray Ejecter, Pre-applied Screen Protector and Protective Case, Important Info. Booklet with Warranty Card and Quick Guide"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51xHk2HlelL._SL1100_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/51xHk2HlelL._SL1100_.jpg", "path": "full/cada4e91b9a4348515e2e4c0e27d8fac672dbd57.jpg", "checksum": "2633ca2e17f6d99c593b21218614856d"}]},
{"title": "Nokia 105 (Black)", "brand": "Nokia", "rating": "4.1 out of 5 stars", "price": "1,027.00", "colour": "Black", "instock": true, "reviews": ["Using the mobile phone for last 3 months. I am a smartphone user but I purchased it as Smartphone is not allowed in defence area. But it is very disappointing that the calling voice is not clear. Most of the time you can't hear the voice. So the Purchase was a Waste. Don't purchase this mobile.", "Nokia is very cute and light weight and battery life is very long lasting..for 03 day's.", "Love it..", "Thank you AMOZON 😊", "Excellent palm phone, really fantastic for busy employees. I'm a site engineer,  with the busy schedule's can't even get time to charge the phone. After buyed Nokia 105, sunday is enough to charge the phone. Thanks nokia. And excellent  delivery by amazone", "Recommendations: yes", "Package: phone box comes inside the Amazon plastic  cover", "Seller: Appario Retail Private Ltd", "Price: 980.00", "Advantages/Highlights", "-------------------------------", "4.572 centimeters (1.8-inch) display with 240 x 320 pixels resolution", "S30+ operating system, 4MB RAM, 4MB internal memory and single SIM", "800mAH lithium-ion battery", "1-year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "My Review", "----------------", "Good feature phone. Rough usage. Buy if you want only calls and SMS and not expecting any advanced feature. The torch has become mostly used feature :-). Lightweight. Good for preteen kids if you don't want him to be on mobile apps always but still want to communicate with him. Also good for people who what to be away from too much of technology and just are looking for a simple mode of communication.", "One last thing, Please hit YES-Button if you found my review HELPFUL", "It has only 4 to 5 ringtones and volume level of ringtones aren't as before nokia keypad phone has enough to listen outside from pocket. Body of phone isn't good its average.Battery backup is good and talking quality perfect.", "I came across issue on this phone in warranty period 1) Nokia customer support center suggest that this phone is no longer repaired but replaced hand to hand by seller 2) amazon deny any service 3 ) amazon ask for service denial letter from support center 4) support center dont give any letter ... find myself stuck unable to get warranty..... sucks !", "Nice mobile phone provide nokia campany", "Worth fr money smooth finish ..do order back cover along vit it"], "description": ["4.572 centimeters (1.8-inch) display with 240 x 320 pixels resolution", "S30+ operating system, 4MB RAM, 4MB internal memory and single SIM", "800mAH lithium-ion battery, doesnot support 3G or 4G", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Toll Free Number: 1800 1028 169 for product related assistance"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51wrcikRDcL._SL1126_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/51wrcikRDcL._SL1126_.jpg", "path": "full/5457a7eca29c784218b242b2c662b9b13ea83d48.jpg", "checksum": "71cb9510aac94dcf6e9885179088d5fb"}]},
{"title": "Realme U1 (Brave Blue, 3GB RAM, 32GB Storage)", "brand": "realme", "rating": "4.4 out of 5 stars", "price": "9,999.00", "colour": "Brave Blue", "instock": true, "reviews": ["I bought this phone on first sale. It looks gud, gives u feel in hand, comfortable grip and gud performance during games.", "But contrary to ther statement of best camera phone, this one is the worst. Rear camera images r blurr, hazzy and if u zoom they r very grainy. Color reproduction is poor. In portrait mode nothing works properly, it can't differentiate the object from background. In low light degraded performance persists.", "Talking about front camera images only look gud but when u zoom the images, output is always grainy even in day light. Night images are intermittent u may c same object with same lights n background appears differently some time they r gud but other times they may b out of focus, hazzy and overall images r always grainy.", "Very good phone. I like the display a lot. It is big enough to enjoy videos.", "I would say wow for this awesome mobile..", "Pros: Camera: Front camera is awesome,  Realme gives you a premium front camera on a mid range smartphone. It blurs the background and gives you a better portrait mode than rear camera.", "Front camera gives you a bright and clear picture even in low light without requiring a front flash.", "Battery Backup: It has a decent battery backup,  im using this mobile for over a week now and I didn't find the battery to be disappointing, for a normal usage it lasts for 1.5 days easily and on heavy usage it lasts for 1 day.", "Performance: It has a normal performance, it will not disappoint you but yes it has an average performance not too fast but till now it never gave me any problem in terms of performance.", "Looks: This is the major reason why people would prefer buying this smartphone, believe me U1 has premium built quality, attractive shining bright colours and no one can say that its a mid range smartphone by its looks.", "Unlocking: This is the best thing which I loved about U1. Face unlock is the best it also works in low light, I have used oneplus 5t and face unlock is the same on both the smartphones.", " Everything is outstanding at this price..  Believe me you'll not get all this on a different smartphone for this price.", "If I compare,  what vivo is giving for 21k, you are getting those features in 12k (Looks, camera, batter life and other features) If you are looking for performance please purchase oneplus, it has best performance in the market.", "Cons: I dont wish to mention it personally but just want you guys to know that it doesn't have fast charging.", "There are no other cons..", "Overall its a best smartphone for this price and", " Fake Mobile In Unbox Please Do Something Please", "I am using from last 1week.... awesome futures with superb look .... it's tooo better then redmi and other mble in market......", " Pros...", ".the water drop display looks rich and amazing display quality", ". battery charg fast(2hr full charg) and drains slowly even playing pubg continually....", ".frant and back cemara are best in this proice", ".Speaker is decent louder as much as we required", ".best futures of colour os...etc", "Con's:", "I can't find till now any cons ..bcz it's roking.....", "This phone is nothing less than Realme 2 pro but its also an improved version of realme 2 pro and Color OS. Little Bigger display than Realme 2 pro, battery issue which i faced in Realme 2 pro is fixed in U1. It doesn't drain quickly and charges the phone at an average good time. Selfie camera is awesome and primary camera is slightly better than Realme pro 2. Phone's performance is equally same as realme 2 pro, so cant really say about the processor. Both SD 660 and P70 is winner. Design and built quality is same, nothing metallic, so using the free case which I've received along with it . Facing little data connectivity issue, but cant say if the problem is with the phone, it could be network issue. Didn't receive the earphone in the box. Why phone companies have stopped sending earphones with the phone? I guess, there are very few phones which come up with the in-box earphone. Audio quality is  good, enjoyed the loudness without earphone, better and louder any other phone. The display is not very bright, it could have been slightly bright like Redmi or Huawei's phones. But the video quality is amazing, you'll love watching movies in FHD and the dewdrop notch is so perfect to make your viewing experience fantastic.", "Few improvements in Color OS. Finally, we can close the notification by simply sliding towards the right side with the finger. Apps' icons are little smaller in comparison with other realme phones.", "Its been 1 days since I got my hands on the phone, many more things to see and notice on this phone. Will leave my next review in Jan, 2019", "1. Battery is awesome", "2. Rear camera low light performance average but front camera pretty cool", "3. I played pubg almost 2 and half hour and battery was drain to 92% to 60% good backup while gaming i faced some minor frame drops playing in high graphics settings and its consume 10% battery in 30 minutes", "4. Display is pretty awesome and sound quality superb in this device", "1.8 gb ram are available out of 4 gb and 48 gb storage available out of 64 gb", "Finger print and face unlock is super first over all nice product go for it😊", "Good phone. Fast delivery by amazon.", "Pros", "1 camera quality both selfie and back are awesome", "2. Battery back up is good", "3.Good buid quality", "4 finger print and face unlock both works smooth", "5 network connectivity and internet speed better than other phone like samsung MI", "Cons", "1 no fast charger take almost 2 hour to charge 100 percent", "2 no ear phone", "3 no fast charger", "4 no notification led"], "description": ["13MP+2MP dual rear camera | 25MP front camera", "16.002 centimeters (6.3-inch) FHD+ multi-touch capacitive touchscreen with 2340 x 1080 pixels resolution, 409 ppi pixel density", "Memory, Storage and SIM: 3GB | 32GB internal memory expandable up to 256GB | Dual SIM (nano+nano) dual-standby (4G+4G)", "Android v8.1 Oreo based on Funtouch OS 5.2 operating system with 2.1GHz MediaTek Helio P70 octa core processor", "3500mAH lithium-ion battery", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/713kEBUCw-L._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/713kEBUCw-L._SL1500_.jpg", "path": "full/e1137b2b1f8a0d37b50f64846fdbb42ddcf1c97c.jpg", "checksum": "da8aca5de3a522ea4cf620c542c05e9a"}]},
{"title": "OnePlus 6T (Mirror Black, 6GB RAM, 128GB Storage)", "brand": "OnePlus", "rating": "4.5 out of 5 stars", "price": "37,999.00", "colour": "Mirror Black", "instock": false, "reviews": ["I got this phone on Friday evening.", "Pros:", "Great battery life", "Amazing performance", "Premium design", "Impressive rear and front camera", "In display fingerprint scanner is really fast", "Cons:", "No headphone jack but you'll get a converter", "No notification LED", "No microSD card slot", "I will give points on my personal experience of 2 days full usage as below:", "Weight: 9/10", "OS: 10/10", "Screen size: 10/10", "CPU: 10/10", "Performance: 10/10", "Storage: 10/10 (you'll get approx 113 gb for use)", "Battery: 8/10", "Rear camera: 10/10", "Front camera: 10/10", "In display fingerprint scanner: 9/10", "Face unlock: 10/10", "I hope this will help full.", "Camera quality is not upto the mark. I visited one plus store and the store representative checked my phone and compared the camera quality with his demo phone. He noticed a significant difference between the two.", "I request Amazon to replace my phone with a new one as it is evident that this phone has some problems.", "1. The Battery lasts max of 6 hours.", "2. Major application not working in the upper side of the screen.", "3. Camera quality is very poor.", "4. Audio output through earphone is very poor, same earphone works with other phone is excellent.", "5. While in a call unable to drop down the notification window.", "6. Video quality is very poor compared to other less price phones.", "I have applied for replacement, not going to take any replacement for such a worst product.", "I charged the phone completely out of the box and then turned it on.  It went to the Oneplus logo screen but did nothing after that.  No buttons work, no combinations of any buttons do anything to take it out of logo screen, it won't even turn off.  Amazon won't allow return until technician looks at the phone???  Oneplus support said take it to a service center but couldn't tell me the closest one.  Really disappointed in lack of support form both companies for a brand new product and release.  I'm sure they will now try to push a replacement but I'm not really interested in the product anymore.", "One plus 6 was costing 28k during the big billion sale and 6T costs  38k. It is not worth to spend 10 k just for some small improvements.", "I ordered one plus 6t phone today I got delivered wen I opened found that ear phones missing in the boxes plz let me clear the issue", "Good build.", "amazing battery life. ( Minimum 3 days stand by along with basic use in airtel's 4g network)", "good accessories on op site.", "cool phone box packing.", "in display fingerprint sensor & face recognition both are good.", "loudspeaker is decent. has a c type to 3.5mm adapter in the box.", "value for money. Go for it!", "OnePlus 6T turned out to be an utter disappointment for me. I received a faulty device and when tried getting support from OnePlus I received disappointment only. Even after 6 calls, several mails and a visit to the service centre I got no solution as such. The cherry on top of all this was lie by the people at service centre. He couldn't connect my device to the laptop for software update and told me he updated the device. I could see that my email id was still there. How's it even possible if the software was updated after hard reset?", "My device has battery drain and heating issues along with apps crashing.", "It's not just OnePlus but Amazon too didn't help me either. They couldn't even connect a call to the technical support department.", "I feel cheated and betrayed by both OnePlus and Amazon."], "description": ["Camera: 16+20 MP Dual rear camera with Optical Image Stabilization, Super slow motion, Nightscape and Studio Lighting | 16 MP front camera", "Display: 6.41-inch(16.2 cms) Full HD+ Optic AMOLED display with 2340 x 1080 pixels resolution and an 86% screen-to-body ratio", "Memory, Storage & SIM: 6GB RAM | 128GB storage | Dual nano SIM with dual standby (4G+4G)", "Screen Unlock: In-screen fingerprint sensor. The OnePlus 6T unlocks in 0.34s for a seamless and intuitive unlock experience", "Operating System and Processor: OxygenOS based on Android 9.0 Pie with 2.8GHz Qualcomm Snapdragon 845 octa-core processor", "Battery : 3700 mAh lithium-polymer battery with Fast Charge technology", "Included in the Box: Screen Protector (pre-applied); Translucent Case; OnePlus Fast Charge Type-C Cable; OnePlus Fast Charge Power Adapter; SIM Tray Ejector; Quick Start Guide; Safety Information; OnePlus Type-C to 3.5mm Audio Jack Adapter"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/51EfDWKl24L._SL1300_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/51EfDWKl24L._SL1300_.jpg", "path": "full/0b6e3acce4bd2970e52037e980dbbce457406377.jpg", "checksum": "5ec0f92c5cf3522d8397ad447ea85006"}]},
{"title": "Samsung Galaxy M20 (Ocean Blue, 4+64GB)", "brand": "Samsung", "rating": "3.9 out of 5 stars", "price": "11,990.00", "colour": "Ocean Blue", "instock": true, "reviews": [" If you are planning to buy this mobile, then read this & then decide it yourself.", "I bought Samsung m20 in first sale, using it from last 2 weeks.", "As samsung launched such mobile first time at this competitive price, expected many things.", "Pros:", "1. Samsung branding: so you can expect better after sale support in service center,incase if you need to visit.", "2. TFT Full HD+ display: though it's not Amoled, but still looks good in outdoor & bright enough, Notch display.", "3. 5000 mAh battery: With moderate usage, it will last for more than a day. ( with 7-8 hours Screen On Time)", "4. Widevine L1 support: You can stream HD content from Netflix or Amazon prime video.", "5. Wide angle camera works well.", "6. Type C support.", "7. Dolby atmos & Cam2api support.", "8, Camera is average.", "Cons:", "1. PUBG works in medium settings, but after 20 minutes mobile starts heating, same in case of Asphalt 9.", "2. Though it supports Fast charging, but still takes 2 & half hours to charge fully.", "3. Processor is Exynos 7904, which is less powerful than Snapdragon 636.", "4. You can reduce brightness upto certain level, but if you are using mobile mostly at night or your kids gonna use it, then it will be some serious issue.", "5. No notification LED.", "6. Lags while multitasking, it takes few seconds to load app.", "7. Auto brightness doesn't work properly.", "8. No EIS (Electronic Image Stabilization) for front camera while video recording.", "9. As it has plastic glossy finish, attracts fingerprints easily.", "Final Words: If you are someone looking to buy mobile for your parents, then this is good choice.", "But If buying for gaming and performance then this is not the right choice, Don't buy it.", "If need, Will edit review, after using for few days.", "Pros -", "1. Big battery, almost 1 and half day with moderate use.", "2. Camera is good.", "3. Notch screen, just beautiful", "Cons -", "1. So far, I am facing the most ancient disease of samsung on mid range phone ie. Hang issue. Sometimes, it's apps are open automatically.", "Overall, I have purchased this item because I want a big battery phone and I am glad it is up to the mark.", "P.S. - the con is have wrote above is maybe I received a faulty product. Hope it May help you guys to make your decision.", "Pros: Cheap, Screen size, weight, Audio clarity in headset, Smooth OS (4 GB Model).", "Cons:", "1) Lot of junk samsung pre installed apps. No option to uninstall.", "2) Even though phone had 5000 mah battery hardly get getting 1 day backup with 6 hours sot.", "( only 8 apps installed other than pre installed like whatsapp, outlook, facebook, myjio, jio tv and 3 bank apps)", "3) Camera quality is very poor. Painting effect is more in photos if we zoom.", "4) Phone gets overheated if we watch youtube or in memory movies more than 40 to 50 mins", "After disabling 6 Samsung apps my phone backup increased. Now I am getting more than 1.5 days battery. Around 2 GB free ram. OS is very smooth.", "After 3 days", "Disabled all Samsung inbuild apps and Facebook, After 37 hours from full charging 7 hour screen on time I have around 28% battery left with Jio and bsnl sims.", " Defective product received. The cell phone is hanging up again and again.i recently visited to Samsung Care Center they checked my phone and said that your phone have some sort of manufacturer default.", "Friends this is my feeling that more good options are available in this price-", "1. display durability very poor but quality is great.", "2. Camera quality is not satisfying specially front camera.", "3. Low light image quality is very poor.", "Firstly the look of the phone is amazing with its amazing notch display it looks attractive.", "The phone battery is awesome 5000 mAh.", "Although it has huge battery still its light weight that's great.", "Having a good hand feeling it feels easy to hold.", "With its Octa-core processor its faster than any other phones in this range.", "Back camera is dual camera and is quiet good with 13+5 MP. Good portraits and even good low light", "photos with LED flash, panorama, HDR.", "Even good vidoes in 1080p @30fps.", "8MP front camera with 1080p@30fps video recording that's something more amazing.", "It has display of 6.3 inches, with 1080 x 2340 pixels, and aspect ratio of 19.5:9.", "This phone is worth buying in this price range available in two variants 3+32 gb and 4+64 gb and also", "in two colours charcoal black and Ocean blue.", "Finger print sensor and fast face unlock.", "In this price range being a renowned brand people are gonna run after this that's for sure. Its gonna be", "a tough fight between other mobiles and this one"], "description": ["13MP+5MP ultra-wide dual camera | 8MP f2.0 front camera", "16cm (6.3\") Full HD+ Infinity V Display with 2340x1080 crystal clear resolution (409 PPI)", "5000 mAh battery with 3x fast charge | 15W Type-C fast charger in the box", "4GB RAM and 64GB internal memory expandable up to 512GB in a dedicated slot", "Fast face unlock and fingerprint sensor | Dual SIM (nano+nano) with dual standby and dual VoLTE", "Widevine L1 certification for HD streaming | Dolby ATMOS 360 surround sound", "1.8GHz Exynos 7904 octa-core processor | Android Oreo v8.1 OS", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Just fire up the front camera for lit selfies on your social feed with the In-Display Flash and F2.0 aperture."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/61nzw1i2taL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/61nzw1i2taL._SL1500_.jpg", "path": "full/b10abef82f5439d636743a81cb3065bf4f141156.jpg", "checksum": "0603d7441975859e76dabbc7312fe1b3"}]},
{"title": "Samsung Galaxy M10 (Ocean Blue, 3+32GB)", "brand": "Samsung", "rating": "4.0 out of 5 stars", "price": "8,990.00", "colour": "Ocean Blue", "instock": true, "reviews": [" Well, I was a bit sceptical before buying this Samsung Galaxy M10, so", "I bought this", "phone on the second sale & placed the order for the variant ie", "3GB+32GB for ₹8990. Here is the detailed review of this device with", "pros and cons ratings. Few camera samples are also attached to this", "review.", "Pros:-", "1) Very lightweight", "2) It looks beautiful and has a huge display", "3) Nice crisp display", "4) The infinity V display looks great", "5) Ultra Wide dual rear camera", "6) Dedicated Micro SD card slot", "7) No heating issues", "8) Face unlock works smoothly", "Cons:-", "1) The rear camera is worse", "2) The back panel of the phone is not that good", "3) It is not having fast charging support as it is having a USB port.", "4) No Fingerprint scanner", "5) Only 2.4Ghz Wifi Support", "6) Not a PUBG Phone", "7) Bloatware (Though we can disable them)", "8) Bigger bottom bezel than M20", "9) 1Amp Charger in the box", "Ratings:-", "Design: 7/10", "Display: 9.5/10", "Battery: 7/10", "Back camera: 6/10", "Front Camera: 7/10", "Processor: 7/10", "Call Quality: 8/10", "Face unlock & Fingerprint: 7/10", "Speakers: 8/10", "Pricing: 8.5/10", "Now let's come to the detailed review:-", "# Box contents:- In the box, you will get the handset, Charging", "adapter, USB cable, Sim ejector tool and user manual.", "# Design:- The design of M10 is great and I bought the black variant,", "it looks beautiful in hand and as I said earlier it is an attention", "grabber.", "# Build Quality:- It is fully made up of plastic & and the back side", "of the phone is having plastic finishing but it is polycarbonate and", "it is very prone to scratches. I will suggest you buy a back cover.", "# Display:- It is having 16CM (6.3) FHD+ Dewdrop full view display,", "with broad 90.8% screen-to-body ratio, 19.5:9 aspect ratio, and 2.5D", "Gorilla Glass, it gives the screen a premium look. The bezels are less", "and the bottom chin is quite very thin which makes the viewing best. The", "viewing experience is great and in sunlight the screen is visible.", "# Battery:- It is loaded with 3400 mAh battery, if you are a moderate", "user, it can give you the battery backup for around 1 day or more and", "if you a gamer (playing high-end games) it can give you a backup for", "whole day.", "* I have charged this phone from 20% to 100% the time taken was 2", "hours 20 minutes.", "# Audio:- The speaker of this phone is very crisp and clear. The audio", "through the earphones are just WOW and you will also get an opinion", "for the Equalizer in the phone settings.", "# Performance:- The M10 runs on 1.6 GHz Exynos 7904 octa-core", "processor. All the high-end games like PUBG, Asphalt 9, Unkilled runs", "average. You cant get winner chicken dinner with this phone", "easily.", "# Camera:- It is having selfie-5 MP front camera and the rear camera", "is having 13 MP+5 MP ultra-wide angle dual camera. The front camera works", "best under natural lighting conditions, but the rear camera struggles a", "lot in low light conditions. (I have attached a few camera samples)", "# Security:- The face unlock is not that fast and we should be as well worried about the security, I've seen few videos on Youtube where users have by-passed it.", "# Connectivity:- It supports 4G LTE connectivity and in the WiFi, it", "supports 2.4GHz routers if you are having a 5GHz router then this", "the phone will not support the frequency (Attached a screenshot and video)", "# Pricing:- The pricing of M10 starts for ₹7990 ie for the base", "variant (2GB + 16GB) and the other variant ie (3GB + 32 GB) is priced", "for ₹8990. If you are looking for a budget smartphone for less than ₹9000 then I will recommend you to go for the 3+32 variant of the Samsung Galaxy", "M10.", "#SUMMARY:-", "If you are in a very tight budget with ₹9000 then I will definitely", "recommend you to buy the 3+32 GB variant of the Samsung Galaxy M10", "because at this price point it offers you good performance(NOT FOR", "HARDCORE GAMING ONLY FOR MODERATE USAGE AND MODERATE GAMING), an okayish build & looks, crisp and clear screen, loud & crisp speakers, a decent dual rear camera and a decent front camera. If you want a good phone with gaming at a budget price range then don’t go for this phone.", "This phone gives a very nice completion to the many phones out there in", "the market like Redmi 6, Redmi 6 pro, etc.", "I hope my review was helpful!", "Ordered this product in the First Sale. And i have to say samsung has done a really good job in the budget segment. Phone Doesnt look or feel cheap.", "Pros:-", "1. price is really competetive with Samsung Branding", "2. Battery Life is Good", "3. Screen Looks Great with hd+ Resolution", "4. front Camera Is good enought for selfies", "5. phone is light weight", "Cons :-", "1. Rear Camera is not that great. But still u get a ultra wide lens at entry level smart phone", "2. No headphones included", "3. Low internal Storage at base model", "At price of 7990 its a great phone. I just bought this to  review.. U should go with atleast 32gb Model its more practical in daily life. Phone Works Great in day to day life. exysnos 7870 is good enough to  handle daily tasks.. and Samsung Experience 9.5 feels snappy.", "Technoholic Life", "It's a worthless phone with only dislikes. The product is not up to the mark, the built quality, the resolution and the best part is the the camera is even worse. The dual camera is for name sake and you end up having pathetic pictures. It's best to have some different category phone for the same price brand rather than going for M10.", "Also please note Amazon is not providing any service to return the product. They are just over promoting and overhyped the product to  catch the customers in the  net. Once it's sold as per them, they can't help.", "Crux of the story from my side is don't go for it.", " Don't buy this phone. Because phone itself switching off automatically. This phone not switching on please watch the video", "Well phone is quite nice in look.", "Battery performance is excellent.", "Samsung did really good job in theme .", "Phone should have an internal app lock as i think", "Pros:", "1 . Display  touch response is excellent.", "2 . Wide angle camera is quite impressive.", "3. Batter backup is great .", "4. Phone runs smooth.", "5. Boot time is fast", "Cons :", "1. No led light for notification and charging.", "2. No time lapse and hdr mode in camera", "3. Face lock is slow and might work too late in less lighted area.", "4. Pubg is quite slow in these phone but can play in low settings..", "5. Front camera is shakky sometimes.", "There is nothing special about this phone except big screen.", "1. Camera experience is worst ever compared to other phones in this range.", "2. Poor body build.", "3. You Tube videos shows blur, even you play HD videos .", "4. Backup is not up to the mark. It takes almost 3.5 hrs to recharge.", "5. I strongly recommend not to buy this Samsung M10 and even Amazon return policies are worst. So think read all T&C before going with this product.", "Excellent Phone in this budget. I've gifted it to someone. She likes it very much. Ocean color is awesome. Performance is also very good. Light weighted. Handy Phone.", "Amazing mobile for best price happy with product"], "description": ["13MP+5MP ultra-wide angle dual camera | 5MP f2.0 front camera. The internet usage time is 15 hours for 3G as well as 19 hours for LTE.The video playback time is 17 hours and audio playback time is 84 hours", "15.8cm (6.22\") HD+ Infinity V Display with 90% screen ratio", "3GB RAM and 32GB internal memory expandable up to 512GB in a dedicated slot", "Fast face unlock | 3400 mAh lithium-ion battery", "Dual SIM (nano+nano) with dual standby and dual VoLTE", "1.6GHz Exynos 7870 octa-core processor | Android Oreo v8.1 OS", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/613Os2k0a2L._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/613Os2k0a2L._SL1500_.jpg", "path": "full/9095a2873a676586b8da4faf926b46ffaaf45d34.jpg", "checksum": "a4cfb99edb8bafd80a08805c3fc22a6a"}]},
{"title": "Moto E5 Plus (Black, 3GB RAM, 32GB Storage)", "brand": "Moto", "rating": "3.8 out of 5 stars", "price": "7,927.00", "colour": "Indigo Black", "instock": true, "reviews": [" Hi Everyone, it’s my sincere suggestion NOT to buy this phone. I purchased this less than a month ago. Haven’t installed any major 3rd party apps and still this phone is troubling me. It shuts down automatically and then it becomes a huge problem to restart this phone because everytime you restart it, it switches off again that very moment. At this very time when I am writing the review, the phone is not even restarting now. My money is wasted. This phone is not worth buying. Don’t waste your hard earned money on this phone.", "I am a fan of Moto G series mainly due to its durability and have been using it since its introduction. But Moto E5 Plus disappointed me badly. A minor drop on the floor resulted in a damaged screen within one month of purchase. The 5000mAh battery also started draining very quickly within the same period even with normal usage. There are a no of other brands available for the same price, so choose wisely.", "Mobile has hang issue and front camera quality is bad and it hang during the phase change.i.e. from back to front camera. phone heats during the call and charging . I requested to amazon for return but they are denying for return.", "Only one option I have to go to consumer court.", "Nice product.", "Good mobile Excellent.", "Screen cracked automatically", "I've been using this mobile for more than a month now. It is very handy. I love big phones with good camera and this phone really suits my need. The storage capacity and the power of the battery makes it a best phone than the ones I've been using before.", "Battery drain very quick,it didn't last even 5hrs but in the add its showing that 18hrs of playback time. Lol 🤣....", "Other draw backs.", "1.Rapid charging ( just for attention only never mind) even it takes more than 6hrs to charge to get 100%*note when the phone is off.", "2.face detection wont work and about the finger print reader,may be work some times like oru indian govt. 😅", "3.lock buttons & Volume buttons in wrong position.", "4.I bought this phone on 27th nov and returned back , The funny thing is it didn't even detect the sim card ,networks ,and even wifi .... Hihi", "Highly satisfied with its performance till date and its Battery Life"], "description": ["Camera: 12 MP Rear camera with Laser auto focus and LED flash | 5 MP front camera with flash", "Display: 15.21 cm (6-inches) HD+ Max Vision IPS LCD capacitive touchscreen display with 720x1440 pixels and 18:9 aspect ratio", "Memory, Storage & SIM: 3GB RAM | 32GB storage expandable up to 128GB with dedicated slot | Dual nano SIM with dual standby (4G+4G)", "Operating System and Processor: Android 8.0 Oreo operating system with 1.4GHz Snapdragon 430 octa core Processor", "Battery: 5000 mAH lithium Polymer battery with 10W Rapid charging", "Warranty: 1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Included in box: Headset, 10W charger and USB Cable", "Do less scrolling on websites. Get a crazy-wide landscape view of games."], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81itIGQ7muL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/81itIGQ7muL._SL1500_.jpg", "path": "full/2099474e3099b599721e0a6d5c3695ee60e1cb3b.jpg", "checksum": "d74f26c065c5e3e78c63a9543efa307a"}]},
{"title": "Mi A2 (Black, 6GB RAM, 128GB Storage)", "brand": "Mi", "rating": "3.8 out of 5 stars", "price": "15,999.00", "colour": "Black", "instock": true, "reviews": ["●The special feature which makes it's different in the segment or even some flagship models is it's Camera.", "The Camera is amazing.", "●I was using Mi A1 and that was also a perfect phone even better than Mi A2 in terms of Screen, Sound and Battery Quality. But still, I upgraded to just because of it's Camera.", "●The phone is too sleek and gives a premium look (If you don't put cover on it)", "●There is no joke in terms of dual camera setup what are generally other manufacturers are doing. (Most of the company are providing just 2MP setup in the name of dual camera, which is not too much effective and just for the name of dual camera)", "●Stock Android is too fast even 3 GB RAM is sufficient for this chipset unless you play games on mobiles.", "●Enduring Battery Backup is 24-30 hours depending on your usage.", "●Selfie Camera is class across the all leading mobiles.", "●Screen & Sound Quality is just average and not so good, If I compare to MiA1", "● Call Voice clarity and Signal reception is too good just like the Mi A1", "●And yes you have to compromise with battery backup, Audio Jack and no expandable storage option. There is some sensors issues too what I am noticing (may be resolved in OTA updates)", "But still, searching a Camera centric phone under 20K with very fast processor with uncustomized Andorid (Stock Andorid) then your search comes to an ends on this device.", "Go for it surely", "nothing great, other than camera, facing a major problem while calling screen is not getting off and causing call drop, going call on mute, flash getting on etc.", "Pros:- all good, big screen, really good camera, looks", "Cons:- the type c connector provided along is not working. I have tried two different brand headphone but the phone is not detecting it so it could be faulty type c connector? Or is it specific to Mi headphones only?? Because under the headphone setting it shows MI headphones option only.", "Can anyone help?", "Overall rating 3.5/5 cant give 3.5 stars so 3* rating.", "I bought this in the Amazon sale for 13.5k so for that price its a very competent smartphone but it has some major drawbacks at regular MRP that stops it from being a perfect mid ranger. Drawbacks mentioned under cons.", "Now you might be thinking by reading the previous statement that aha, we know what they are, but no reader they are not what you think. I am not taking about the missing micro sd slot or headphone jack.", "Vs Nokia 7 Plus", "I bought this phone because someone stole my Nokia 7 plus. I had lived with a same spec phone for 5 months and let me tell you the A2 is a way better phone in terms of performance and smoothness. The 7 plus from day 1 always stuttered, froze and had janky animations. Even after multiple updates the 7 plus was not a smooth performer. So performance is a plus. The A2 performs as a SD660 phone should.", "7 plus had better battery life. Yes 7 plus has a bigger battery but battery drain under load was also less on the 7 plus.", "Phone supports Quick charge and I have the qc3.0 charger so I can take advantage of fast charging feature. Standard supplied charger is a 10W charger. Even with screen on the fast charging keeps working unlike the 7 Plus and some other phones.", "Build quality on Nokia 7 plus is better but that also costs more. A2 is well built as well but the Nokia is better. A2 is slippery AF, the back is super smooth.", "Display is better on A2 since it has no jelly effect(which the Nokia had) and the calibration is a waaaaayyy better compared to Nokia 7 plus  which has an awfully high white point and terrible RBG & grayscale performance. Brightness is about the same.", "Cons", "1) A2 has adequate battery life. 5PM topups are required if you use all the features of the phone. This is not an all day phone.", "2) No widewine L1(has L3) certification means no FHD Netflix and Amazon prime. You are stuck at 480p. This is really bad, my 5 year old Xperia Z3 has Widewine L1. This is just penny pinching where a manufacturer should not penny pinch.", "3) No LDAC support even though this is an Oreo feature. I tested using Sony wireless headphones which support LDAC.", "4) Pathetic vibration motor.", "5) No Hybrid sim slot. For 2 sim users like me this is not a deal breaker since we know what we are getting into but no micro sd slot is a turnoff for many.", "6) No IP certification. Yes I know its a mid range phone & I'm not expecting IP68 but IP54(Splash proof) IMHO is a must on all phones above 10K.", "7) Only USB 2.0 support. its 2018 manufacturers 3.0 only cost 15-20 cents more to implement.", "8) Does not support Pixel camera mod, Nokia 7 plus supported it.", "Pros:", "Android One", "Snappy performance, its nearly SD835 fast. I tested using PC mark and the Work 2.0 scores are within 10%. My other phone has SD835.", "QC4.0 support and backwards compatible with all versions of Quick Charge.", "USB Type C.", "Above average cameras, competent for the segment.", "Conclusion:", "When you buy a smartphone you are looking for the complete experience and this phone does not provide that in a few key areas like the lack of widewine L1 and LDAC support. I have been aware of widewine L1 b4 the pocofone controversy because unlike Netflix, Amazon prime supports only a handful of Samsung, Apple & Sony devices for 1080p & HDR playback and even if your phone has widewine L1 unless the phone is Amazon certified you will not get 1080p playback in the prime video app. So the first thing I tested was the DRM info and this phone lacks widewine L1 which is a bummer.", "I can understand the lack of aptx since that requires additional royalties to qualcomm and the A2 being a midranger I can see why Xiaomi chose to not provide aptX or aptx HD but no LDAC, come on there is no headphone jack on this device so the least Xiaomi could have done is enable a feature that is baked into the Oreo OS to at least provide the best BT audio codec.", "Considering the sharp fall is data rates and the rise of streaming video services which a ton of users use its baffling that Xiaomi chose to omit 2 really important features which are so important to really enjoy streaming services", "This is a phone that has some very strong points like, Android One, fast smooth performance, support for QC4.0 but then has huge drawbacks which I have mentioned previously along with the missing 3.5mm jack and no hybrid slot support.", "Who should buy the Mi A2: Someone who is looking for a fast snappy performing phone and values stock Android and 2 years of guaranteed updates over features like 3.5mm jack, SD card slot and marathon (7-8 hr SOT) battery run times..", "Awesome product", "Pros:", "Faster chipset", "Good cameras", "Value for money", "Stock Android software", "Quick Charge 4+ support", "Good display", "superb selfie camera", "Cons:", "No 3.5mm audio jack", "lacks a microSD card slot", "Average battery life", "Missing Notch", "Thanks Amazon & Faster n Guarantee delivery.", "It is an awesome phone..  this is for those who wants a better camera.. it's camera is truly amazing.specially the manual mode.. it's speaker is tooo loud. Although having 3010 battery it's capable to last 5hours of use online and 10hours of offline use..", "Awesome phone 👌", "Useless model, I purchased based on xioami quality. Within one month the phone dead. I am running to service centre, got replacement. It's working. Appreciate their services", "Battery draining very fast. Max it come for 12hrs.", "I don't recommend to buy this model."], "description": ["12MP+20MP dual rear camera and 20MP front facing camera", "15.21 centimeters (5.99-inch) with 2160 x 1080 pixels resolution, 403 ppi pixel density", "Memory, Storage & SIM: 6GB RAM | 128GB storage | Dual nano SIM with dual standby (4G+4G)", "Android v8.1 Oreo operating system with 2.2GHz Qualcomm Snapdragon 660 octa core processor, Adreno 512 GPU", "3010mAH lithium-ion battery", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: Adapter, USB cable, warranty card, User guide, SIM insertion tool and Back cover"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/91Dh3ec3EFL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/91Dh3ec3EFL._SL1500_.jpg", "path": "full/55b8c0e8f1edde20eddbb0d03728f8262b859e57.jpg", "checksum": "0008efec232288e5127ec246cf671b37"}]},
{"title": "Redmi Y2 (Black, 3GB RAM, 32GB Storage)", "brand": "Redmi", "rating": "4.3 out of 5 stars", "price": "8,850.00", "colour": "Black", "instock": true, "reviews": ["Guys don't buy this model of Xiaomi, coz their is too many problem in this device also battery is drawing very very quick, I'm so frusted to spent 13000 worthless, pls go with Note 5 pro I think that phone  has commandable for battery life", "If you want to buy a good phone within 10000 I am suggesting you this phone best camera plus everything is good. Best thing no heating while playing PUBG 😂", "This phone looks very nice", "1) photos in day light or good light is awesome", "2) selfie flash is not good, in dark you cant expect too much from front flash poor quality, rear flash does good job", "3) portrait mode is also awesome in daylight (both front with AI and rear with second camera) but in low light quality is poor, portrait mode doesn't supports flash.", "4) you gets 1.2GB free out of 3 GB and 22GB out of 32GB", "5) face unlock and fingerprint does good job", "6) screen size is awesome and screen quality (picture quality) is good", "I got this phone at effective price of 7200/- and its awesome product for this price, overall photo quality is awesome in daylight and in good light but in low light quality reduces greatly.", "I am very happy with phone with effective price of 7200/-", "Dont buy its 4 GB Version other better products available at same cost  and buy only if you get on offer.", "Below are the issues", "1. When you join 3rd person on a call they won't listen when you talk (issue is with not with operator)", "2.Heating issue when on phone on a charge", "3.App Crash when you switch from one to another even with normal apps", "So, I have been talking to so called Amazon Technical Team and trying my best to convince to refund my money, let's see how it goes..", "hope they read my review and respond soon..", "Been using this phone since 3 months from now .. happy with the performance.", "Battery back up and pic quality is good.", "Only cons is that the face recognizion is a bit slow compared to other phones in market.....", "=> Design", "Well, Xiaomi phone from 5k to 20 k have same body. Earlier i used to have Redmi note 5, when i buyed this redmi y2 i found that there is no  change , they are too similar. This phone body is made of plastic which looks like metal . I really miss glass finish at back of the phone. So i will give for design (2/10)", "=> Display", "The color of phone is just average. and yes THERE IS NO SCREEN PROTECTION.  so i will give for display (4/10)", "=> Battery", "I like the battery backup of phone. with just 3080mAh battery it perform well. (8/10)", "=> Software", "It has Mi UI 9.5 with Android 8.1 which is very cool. There are many good features. Trust me It has excellent UI .", "i will give ( 9/10 )", "=> Camera", "If you are looking for camera phone. Then it will good choice. front camera is good . and it has good rear camera too. But I am not very satisfied with camera because i compared it to some other phone of similar price range and i found they have much better camera . score (7/10)", "=> performance", "Yes, It offer a lag free experience . It has good ram management . (9/10)", "=> MY experience", "Well I regret buying this phone, but it is good phone because of its performance and software. camera is good too.", "But there are better phone in this price range!", "Choose WISELY !", "Have been using this phone for 10 days now. Following are the pros and cons which I have noticed", "Pros:", "1. Great selfie camera", "2. Good performance- fast responses", "3. No heating issues", "4. Battery will last for more than one day (I'm not a gamer, but the phone was connected to WiFi throughout the day and I used the phone reasonably well during the whole day)", "5.Good UI and frequent updates", "Cons:", "1. Rear camera is not great. But yes, it does its job decently.", "2. Battery capacity could have been more since phones with higher battery capacity is available in the same price range.", "3. Headset is not provided in the package. The clear case provided attracts finger prints and dirt.", "4. Fast charger is not provided. But this is fine as phones in same price range normally don't have fast chargers.", "5. Speaker performance is not that great", "6. Lags are rarely observed while using depth mode in camera.", "Totally waste dont buy .. battery back up poor...display not working sometime . Display quality not at all good"], "description": ["Camera: 12+5 MP Dual rear camera | 16 MP front camera", "Display: 15.21 centimeters (5.99-inch) HD+ full screen capacitive touchscreen display with 1440x720 pixels, 269 ppi pixel density and 18:9 aspect ratio", "Memory, Storage & SIM: 3GB RAM | 32GB storage expandable up to 256GB with dedicated slot | Dual nano SIM with dual standby (4G+4G)", "Operating System and Processor: Android v8.0 Oreo operating system with 2.0GHz Qualcomm Snapdragon 625 octa core processor", "Battery: 3080 mAH lithium Polymer battery", "Warranty: 1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Included in box: Power adaptor, USB Cable, Clear soft case"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/719shd%2BaqrL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/719shd%2BaqrL._SL1500_.jpg", "path": "full/0d7821cd8fd291f31b5f3deea0b9c7671dba6067.jpg", "checksum": "29471f981497d2118e0072506bd1d435"}]},
{"title": "Honor 9N (Blue, 4GB RAM, 64GB Storage)", "brand": "Honor", "rating": "3.7 out of 5 stars", "price": "9,999.00", "colour": "Blue", "instock": true, "reviews": ["Except the front camera, there is nothing that is good about the mobile , charge doesn't stay for, the screen is too bad screen touch is bad, 128 gb space but still phone hangs several times, having issues to answer calls, waste of money....", "All in all the phone is a good buy", "Pros:", "Excellent Picture quality,Resolution of mobile is charm with Notch display", "Sound Quality is fine considering location of speaker on device.", "Battery is the only Con for this as due to high resolution display and background app power consumption drainage is quick.", "Overall a good buy !!", "Nice pick under this price range. Finger Print Sensor and Face Unlock Feature are very fast and accurate. Even works in low light. Camera Quality is also very nice. Please go for the product. 5 Star from my side.", "Do not support dual volte active standby. No updates also making this product obsolete. So no point in purchasing as the cheaper ones support that", "phone camera is awesome", "Go on", "Like my dream phone, perfect phone that i was looking about, no cons exept one, and that is battery, it could be more powerful. Overall perfect phone for everyone wants the phone for daily purposes. No major flaws.Stylish look and performance is superb. NO headphone.....", "Like my dream phone, perfect phone that i was looking about, no cons exept one, and that is battery, it could be more powerful. Overall perfect phone for everyone wants the phone for daily purposes. No major flaws"], "description": ["13MP+2MP dual camera and 16MP front facing camera", "14.83 centimeters (5.84-inch) multi-touch capacitive touchscreen with 2280 x 1080 pixels resolution 16M color support", "Memory, Storage & SIM: 4GB RAM | 64GB storage expandable up to 256GB| Dual SIM with dual standby (4G+4G)", "Android v8 Oreo operating system with 2.36GHz + 1.7GHz Kirin 659 octa core processor", "3000mAH lithium-polymer battery", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: Charger, USB Cable, Quick Start Guide, Warranty Card, Eject Tool, Protective Case"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/712SXlt3pUL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/712SXlt3pUL._SL1500_.jpg", "path": "full/cdbc9421c673ee2302cdb19f7910a7466ea77d7d.jpg", "checksum": "1fa65e00733f2bfc6765dbcab950f3ee"}]},
{"title": "Honor 8X (Red, 4GB RAM, 64GB Storage)", "brand": "Honor", "rating": "4.4 out of 5 stars", "price": "12,999.00", "colour": "Red", "instock": true, "reviews": ["Basically I'm oneplus3t phone user from past 2 years and so this honor 8x actually is downgrade for me :). Yes, i just used this phone for 4 days and sold in olx for 12500/-.got it for 14034/- post cash back .  Overall the phone is excellent. but the photographer in me who got used to capture stunning pics in oneplus 3t, its not all satisfactory.  the portrait mode is worst.  although the display is good, there is slight lag when you are switching between apps. For people who used low end phones with slow processors, this honor 8x will feel great.", "If your budget is 14000/- . there is only one phone in this segment which you should go for. Mi A2 .", "Mi A2 captures wonderful pictures.", "Pros:", "Not listing as you will only see pros everywhere abt this phone. go on to Cons section.", "Cons:", "Camera is big let down. there are many options in camera,but picture quality is not good.", "Speaker sound is not loud", "There is slight lag when switching between apps", "Wifi connectivity has issues when switching between 4G/WiFi", "Good cell but there are many issue", "1. No video calling", "2. No conference call.", "3. Keyboard are very bad to touch system", "4. swiftkey internal software and is not good very bad system", "5. Night mood camera very bad.", "6. I'm used to  7 days", "Worst camera ever..pictures look like taken by 2 MP camera", "Well where do I start from.  For 15k this is a great phone. I bought it for my dad. I am very satisfied with the phone. Honor have started making very nice n premium phone on low budget. I had also bought real me pro2 from flipkart for my sis. I compared both I must tell u go for honor 8x, real me pro2 doesn't have portrait mode or bokeh mode on front camera.. display is bigger then real me pro2, this is the only difference otherwise both phones are alike. If u ask me then I will prefer honor 8x", "Better than Mi note 5pro or A,", "10/10 design", "10/10 camera", "10/10 battery", "10/10 performance", "If it comes with earphone and little long usb cable than customer will be more happy", "This is amazing powerful and beautiful fon from honor best camera, battery, design, display, sound quality, processor", "I was previously using Lenovo Z2 plus and it was one of the best phones in 2017 offering snapdragon 820 at just RS. 10,000. So after a year it started lagging cuz I was playing very heavy games. So then the new Mid Range phones were Realme 2 Pro and Honor 8X. These were under by budget. I wanted to buy Realme 2 Pro as it had 8gb ram and good camera. But then after watching a lot of youtube videos, I thought I should go for honor 8x. And so I bought this. When I opened the package and took honor 8x on my hand, it felt premium. But then when I started downloading apps from playstore, it wasn't using my data to download it, just wifi. I had to cancel all installs and download it at my office Wifi.", " 2)The next thing is that, the phone is really really HEAVY. I was using it with my left hand while I was sleeping, and literally after 5 minutes my wrist started to pain. But what if it falls on my head or mouth, like all the phones do? While using it lying on the bed? I am going to get a serious injury. In the Tech pages too, they have mentioned this as a Con.", "3)Front Camera:  The Camera really SUCKs. The back camera is okay, but it's saturation is very high especially for Red, Green and Blue. The camera has depth, but it's of no use as the Camera Saturation is high. Don't talk about the front camera, I use my sister's Realme 1 for taking selfies...", "4) PUBG: So when I open the game, it has loading error, says 'Could not connect to server' seems to be network issue, but the Realme 1 loads properly without any issues, even when both the phones are in the SAME room. Also the map in Realme 1 loads faster, maybe because it has 6 GB ram and the one I am using has 4 GB. I should have gone for Realme 2 pro which had 6 Gb for lesser Price.", "I wished I had ordered Realme 2 pro. Too lazy to return then get refund and all. But if you need a light phone, go for Realme 2 pro. it's light, games don't lag and also has a good battery. I'm just somewhat sad.  And the Customer Service of HONOR is so pathetic, they don't know what I am asking and COPY PASTE wrong info in the chat, I once had to talk with a Supervisor to get the correct information.", "My honor 8x display is blurring and I surprise to see the video quality is like 8k to 10k rs cost mobile. I am very disappointed. I am currently using Honor 7x and it's a perfect phone. I expected the Honor 8x will keep the quality as Honor 7x. I think I received a defected phone. Anyway i have requested to replace the phone, and it's processing(after 4 days, nobody came to pickup the phone). I hope that I will get the perfect phone when it's replacing."], "description": ["20MP+2MP dual rear camera | 16MP front camera", "16.51 centimeters (6.6-inch) with 2340 x 1080 pixels resolution", "Memory, Storage and SIM: 4GB RAM | 64GB internal memory expandable up to 400GB | Dual SIM dual-standby (4G+4G)", "Android Oreo v8.1+EMUI v8.2 operating system with 2.2GHz Kirin 710 octa core processor", "3750mAH lithium-polymer battery", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81X-9fGhdcL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/81X-9fGhdcL._SL1500_.jpg", "path": "full/1029acf58ff0413eb2417ffde96458d276852afd.jpg", "checksum": "d84e70dd0894a595e1ccaab65ef22858"}]},
{"title": "Redmi 6 Pro (Black, 3GB RAM, 32GB Storage)", "brand": "Mi", "rating": "4.1 out of 5 stars", "price": "8,999.00", "colour": "Black", "instock": true, "reviews": ["Display quality is top notch, overall the quality of the phone is very good. All metal body. Camera is good too. Touch smoothness is amazing. I will definitely recommend to buy this phone.", "Cheap Chinese product.", "Negatives:", "1. Mobile network signal reception is very weak and says service unavailable.", "2. Slow charging", "3. Overheating", "4. Internet speed too slow", "5. Display width is too small( Feels like 5\" display)", "6. Cameras don't have clarity", "7. 4g signal is weak", "8. Mentioned made in India but says frequently used apps as alipay, qq, etc., which are Chinese apps", "9. Tried to get replacement using smartchk app but it responds like a Chinese electronic voting machine(Votes for Redmi:Says mobile works well)", "10. So no replacements if mobile has quality issues!!!!", "Worth only half the price .ie. ₹6500/- only, since we have to get adjusted to low quality...", "Don't buy this MI 6 Pro ,", "Speaker volume is very bad & Low", "Camera pics are not good at all special back cam having dual cam stabilization problem front cam like VGA pics", "Heating issue", "Battrey drained very Fast", "I got this product and face below issue in 4 days.", "1) Couple of times the Phone gives a ECHO to the Listener on the other end and couple of time to me also.", "2) The charger get hot when you keep it on charging.", "Other issues.", "1) I was using Asus Zenphone2 of 2015 Model with same ram and Internal Memory,but this phone is really very slow in loading web pages an even your tube.", "2) The network keeps on fluctuating.", "Badluck:", "I got in the trap of Amazon Policy saying that we cannot get refund , we can only give replacement. I would request all the user to kindly be careful when you are buying the product. Amazon very smartly mention at only one place that you can get only replacement and not refund.", "So the user has not other option left just to get the product replace.", "Conclusion for me.", "I can only pray that the product work atleast for 1 year and the replace product doesn't have the technical issue and i dont have to run behind the service center.", "I will definitely AVOID buying products from Amazon. Save  my money as I was planning to go for Prime membership.", "Display quality is top notch, overall the quality of the phone is very good. All metal body. Camera is good too. Touch smoothness is amazing. I will definitely recommend to buy this phone.", "The USB is not type C, it is the old one. This is the only con that i found till now. It has got 2 nano sim slots and a dedicated memory card slot (2+1).", "Other than the phone, amazon delivery service is a bit let down. It took 6 days to deliver the item from Calcutta to Assam. Whereas last year i bought 2 Redmi Note 4 ( for me and my uncle) from flipkart and mi india website, if you recall, Mi had flash sale every Friday. Hence i bought both handset on different dates. To my surprise i placed the order on Friday and received the item on Sunday on one occasion and Monday on the other occasion, which the shipped through ekart and FedEx respectively. Merely in 2-3 i got my phone. But Amazon's courier service is a total letdown as compared ekart and FedEx.", "The Red color looks tacky. Guess I should have bought black instead. The phone feels somewhat cheap in red to be honest. I understand Xiaomi did not supply headphone with this phone. I also feel they should have not supplied with the cheap *** and flimsy phone case (Its an insult lol).  Why even send it. Its very generous of Xiaomi India !! Thank you so much (If I will spend Rs.600 on a head phone then surely I can spend another 200 on a half decent phone case).", "The screen is awesome!! So is the battery! User interface is not confusing unlike other brands but I will miss Google Now Launcher which gives lesser mortals feel of stock android (Google stopped providing for newer Android OS). Camera is good.", "This is my 1st Xiaomi phone and I am somewhat happy (damn you red color) with it. And maybe I had higher expectations on the back panel.", "Awesome mobile. I recently switched from MotoG3 to Note 6 PRO. Its really a different experience. Using for last 24hrs and still my battery is 70% left with medium usage of 4G. Worth to buy and use.. Thank Amazon for quick delivery. Thanks Redmi for worthy mobile in such a attractive price..", "\"Phone's Temperature\" if talk or surfacing internet, phone will be hotter.....", "Hanging continuously...", "Have a point on the screen..... If we talk much more time u could be tempted because of phone radiation... Etc...  This phone is not good like Redmi 5pro"], "description": ["12MP+5MP dual rear camera | 5MP front facing camera", "14.833 centimeters (5.84-inch) capacitive touchscreen with 2280 x 1080 pixels resolution, 432 ppi pixel density", "Memory, Storage & SIM: 3GB RAM | 32GB storage expandable up to 256GB with dedicated slot | Dual nano SIM with dual standby (4G+4G)", "Android v8.1 Oreo operating system with 2GHz Qualcomm Snapdragon 625 octa core processor, Adreno 506 GPU", "4000 lithium-polymer battery", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: Adapter, USB cable, Warranty card, User guide, SIM insertion tool and Back cover"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81xl7IHBw-L._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/81xl7IHBw-L._SL1500_.jpg", "path": "full/ed58696f1afbddaafdb0be9469afbd9dc58278ab.jpg", "checksum": "f81216b8932f04e8810aa57a2d8c31d9"}]},
{"title": "Redmi 6 Pro (Black, 4GB RAM, 64GB Storage)", "brand": "Mi", "rating": "4.1 out of 5 stars", "price": "9,999.00", "colour": "Black", "instock": true, "reviews": ["Display quality is top notch, overall the quality of the phone is very good. All metal body. Camera is good too. Touch smoothness is amazing. I will definitely recommend to buy this phone.", "Cheap Chinese product.", "Negatives:", "1. Mobile network signal reception is very weak and says service unavailable.", "2. Slow charging", "3. Overheating", "4. Internet speed too slow", "5. Display width is too small( Feels like 5\" display)", "6. Cameras don't have clarity", "7. 4g signal is weak", "8. Mentioned made in India but says frequently used apps as alipay, qq, etc., which are Chinese apps", "9. Tried to get replacement using smartchk app but it responds like a Chinese electronic voting machine(Votes for Redmi:Says mobile works well)", "10. So no replacements if mobile has quality issues!!!!", "Worth only half the price .ie. ₹6500/- only, since we have to get adjusted to low quality...", "Don't buy this MI 6 Pro ,", "Speaker volume is very bad & Low", "Camera pics are not good at all special back cam having dual cam stabilization problem front cam like VGA pics", "Heating issue", "Battrey drained very Fast", "I got this product and face below issue in 4 days.", "1) Couple of times the Phone gives a ECHO to the Listener on the other end and couple of time to me also.", "2) The charger get hot when you keep it on charging.", "Other issues.", "1) I was using Asus Zenphone2 of 2015 Model with same ram and Internal Memory,but this phone is really very slow in loading web pages an even your tube.", "2) The network keeps on fluctuating.", "Badluck:", "I got in the trap of Amazon Policy saying that we cannot get refund , we can only give replacement. I would request all the user to kindly be careful when you are buying the product. Amazon very smartly mention at only one place that you can get only replacement and not refund.", "So the user has not other option left just to get the product replace.", "Conclusion for me.", "I can only pray that the product work atleast for 1 year and the replace product doesn't have the technical issue and i dont have to run behind the service center.", "I will definitely AVOID buying products from Amazon. Save  my money as I was planning to go for Prime membership.", "Display quality is top notch, overall the quality of the phone is very good. All metal body. Camera is good too. Touch smoothness is amazing. I will definitely recommend to buy this phone.", "The USB is not type C, it is the old one. This is the only con that i found till now. It has got 2 nano sim slots and a dedicated memory card slot (2+1).", "Other than the phone, amazon delivery service is a bit let down. It took 6 days to deliver the item from Calcutta to Assam. Whereas last year i bought 2 Redmi Note 4 ( for me and my uncle) from flipkart and mi india website, if you recall, Mi had flash sale every Friday. Hence i bought both handset on different dates. To my surprise i placed the order on Friday and received the item on Sunday on one occasion and Monday on the other occasion, which the shipped through ekart and FedEx respectively. Merely in 2-3 i got my phone. But Amazon's courier service is a total letdown as compared ekart and FedEx.", "The Red color looks tacky. Guess I should have bought black instead. The phone feels somewhat cheap in red to be honest. I understand Xiaomi did not supply headphone with this phone. I also feel they should have not supplied with the cheap *** and flimsy phone case (Its an insult lol).  Why even send it. Its very generous of Xiaomi India !! Thank you so much (If I will spend Rs.600 on a head phone then surely I can spend another 200 on a half decent phone case).", "The screen is awesome!! So is the battery! User interface is not confusing unlike other brands but I will miss Google Now Launcher which gives lesser mortals feel of stock android (Google stopped providing for newer Android OS). Camera is good.", "This is my 1st Xiaomi phone and I am somewhat happy (damn you red color) with it. And maybe I had higher expectations on the back panel.", "Awesome mobile. I recently switched from MotoG3 to Note 6 PRO. Its really a different experience. Using for last 24hrs and still my battery is 70% left with medium usage of 4G. Worth to buy and use.. Thank Amazon for quick delivery. Thanks Redmi for worthy mobile in such a attractive price..", "\"Phone's Temperature\" if talk or surfacing internet, phone will be hotter.....", "Hanging continuously...", "Have a point on the screen..... If we talk much more time u could be tempted because of phone radiation... Etc...  This phone is not good like Redmi 5pro"], "description": ["12MP+5MP dual rear camera | 5MP front facing camera", "14.833 centimeters (5.84-inch) capacitive touchscreen with 2280 x 1080 pixels resolution, 432 ppi pixel density", "Memory, Storage & SIM: 4GB RAM | 64GB storage expandable up to 256GB with dedicated slot | Dual nano SIM with dual standby (4G+4G)", "Android v8.1 Oreo operating system with 2GHz Qualcomm Snapdragon 625 octa core processor, Adreno 506 GPU", "4000 lithium-polymer battery, AI makes background blurring more accurate, so portraits are more natural", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: Adapter, USB cable, Warranty card, User guide, SIM insertion tool and Back cover"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81xl7IHBw-L._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/81xl7IHBw-L._SL1500_.jpg", "path": "full/ed58696f1afbddaafdb0be9469afbd9dc58278ab.jpg", "checksum": "f81216b8932f04e8810aa57a2d8c31d9"}]},
{"title": "Redmi 6A (Black, 2GB RAM, 16GB Storage)", "brand": "Mi", "rating": "4.2 out of 5 stars", "price": "5,999.00", "colour": "Black", "instock": true, "reviews": ["Redmi 6A has lag problems. This phone is hanging and lags while using YouTube and browser.Redmi 5A is far better than Redmi 6A. I am regretting on my decision for buying this phone. Not satisfied.", "I am going to step you through each aspect of the phone and my thoughts so far.", "Short Version", "Pro's", "- Good budget phone for any one India.", "- Battery life is shockingly good. (ha)", "- Phone feels amazing in the hand", "- Durability of this thing is on point, designed to last instead of break.", "- Speaker sounds not up to mark and even volume.", "- Design part I love it very much", "Con's", "- Picture quality not good they given13 MP Rear camera | 5 MP front camera.", "- Stock camera software is extremely basic, enough for most users but weak for those looking for those great shots.", "- Screen size is not 5.5 inch.", "- Processor can get a little hung up every once and a while but it's barely noticeable.", "- Phone feels so nice that putting a case on it just feels bad encouraging you not to protect it and you should always use protection.", "- It doesn't make me breakfast.", "Overall, what Redmi phone does not everything but it’s budget friendly phone.", "Pros: 1) Decent Video/audio recording with minimum distortion.", "  (noise cancellation is much much better than Redmi 5a)", "  2) Decent Camera for a budget phone.", "  3) good for Android smartphone beginners.", "  4) Can run 3-4 apps in the background without lag/hanging.", "  5) Fast boot.", "  6) Good touch response for a budget phone,  I find it to extra sensitive. haha", "Cons: 1) Bad Video quality for watching movies/ you tube. But I use phone only for calls, whatsapp and sometimes Instagram. I use my laptop to watch movies, so not a big deal for me.", "  2) Unable to share Internet hotspot to computer/Laptop. But I posted a tip on how to solve this problem in MI community India. All you need to do is download an app called PDANet+ (available in Google play store) in both your phone and computer. Go and check it out.", "  Apart from the few drawbacks mentioned above, this phone is quite good for a budget phone. If you can live without the good video quality by watching movies/videos on another device, go for it. The 1440X720 resolution is much worse compared to Redmi 5a's 1280X720. In fact Redmi 5a's video/picture resolution is much better and detailed compared to Redmi 6a. Ordered and received another redmi 6a for my dad.", "Android Oreo 8 itself required 2GB RAM and consuming entire RAM. no memory for applications. Videos play are not good. Not good for Amazon prime videos and hooq. Bloatware found difficult to remove. Not good for e-commerce and mobile banking. Internet browsing experience is unhappy. Poor performance because lack of memory. Just useful for basic phone calls. Only some small applications run without lagging. Worst and limited user interface. Very costly basic phone. Reliance Jio basic phone is far better than this one. This is my first highly unsatisfied purchase from Amazon. My recent 10 or G,even my old GIONEE M2 is better than this. I am not understanding how companies are releasing Oreo 8 phones with 2GB RAM. The hardware configuration may good but difficult to judge because of less RAM.", "*My personal suggestion* Don't buy any phone with 2GB RAM with Android Oreo 8, what ever the hardware configuration may be. You need atleast 3GB RAM.", "I am a big fan of redmi products. I have redmi2, redmi 2 prime and redmi note4.", "So, I decided to by a phone for my Dad and purchased Redmi 6A thinking is its same  or better than its ancestor .", "But all my assumptions failed and here are my detailed analysis", "1. Picture quality is not full HD and you don't enjoy if you already have full HD phone", "2. Camera very very poor quality", "3. Ram size is only 2GB and 16 GB thats bad for the price 5999 and that to long wait.", "Note: I returned this phone and purchased Lenova K8 plus which is awesome with specs 3GB ram and 32 GB harddisk with depth enabled camera and stock android.", "Redmi this time you failed me", "I was quite skeptical before buying this phone for my son. I had read many bad as well as gud reviews about it so was quite confused 😕", "Finally I placed the order and bought it through Amazon.", "Believe me it fabulous product so far.", "The screen is apt and very clear.", "Battery life is very gud and lasts full whole day with heavy use by my son on games etc.", "Memory is 32 GB so lot of space for apps and other material. Infact in these days one shud not buy phone less than 32 GB memory as the no of apps we use are quite large in number and that itself consume huge space.", "Phone is quite light weight and very smart. I chose blue color and believe me it looks classy.", "Only issue it does not come with earphones🤔🤔🤔", "I respect the adverse reviews of many customers as they might have faced some issues but I recommend this to all buyers.", "In nutshell its not only value for money but gud choice too.", "Cheers 👍🥂", "The Service center service at MI is very bad, You go with one problem and come back with many other issues, samsung or oppo phone, service is the best thats what my friends say, Mi may look attractive with the price tag, but after sales is service is not good experience, think twice before buying MI Phones.", "Love the phone. Everything on it works as expected.  I've been using this phone for about 1 weeks, and so far I'm loving it. Here's me breakdown:", "The quality, fit and finish are amazing. No one believes this is low priced phone.", "Battery: exceptional battery life, the best in any smartphone I've had so far.", "Build/design: one of the best smartphone designs and build quality I've used, even compared to much more expensive models.", "Camera: not as good as my Honor 7C, but still takes good enough pictures that it's not really a problem for me.", "Really littil bit difficult to find fault with this phone, especially for the price even I don't like the audio quality. overall Best Product. Durable solid feel, very responsive and works great overall."], "description": ["13MP rear camera | 5MP front camera", "13.8 centimeters (5.45-inch) HD+ multi-touch capacitive touchscreen with 1440 x 720 pixels resolution, 295 ppi pixel density and 18:9 aspect ratio", "Memory, Storage and SIM: 2GB RAM | 16GB internal memory expandable up to 256GB | Dual SIM (nano+nano) dual-standby (4G+4G)", "Android v8.1 operating system with 2.0GHz Mediatek Helio A22 quad core processor", "3000mAH lithium-ion battery", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/510d4L0LYKL._SL1325_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/510d4L0LYKL._SL1325_.jpg", "path": "full/cab0398591831311a437cc99262da69bbad4db0a.jpg", "checksum": "3db0f3c0815cbdde49a67701b432a056"}]},
{"title": "Honor 8C (Black, 4GB RAM, 32GB Storage)", "brand": "Honor", "rating": "4.1 out of 5 stars", "price": "9,999.00", "colour": "Black", "instock": true, "reviews": ["Pros-", "Elegant Design and body", "Face recognition is Fast and impressive", "Fingerprint sensor is fast", "2 full days battery", "Very impressive camera", "40W (forty) charger... Heavy it is...", "Dual sim+ sd", "Cons-", "Slippery back side", "Overall 9.5/10 must buy..", "It's an amazing product by honor. Happy to use it. Looks great. Customer friendly mobile. Camera is not good when you zoom the image after clicking, image got blur. And you can not click a good picture in night with flash. Your Eyes Got Spark and you became a vampire if you click the picture in night . 🤣🤣🤣🤣", "Not Good.", "Why product is not tested before giving to customers. Phone plastic was not aligned properly. Second thing I won't recommend any one to purchase this screen quality is very bad you can't surf your fingers easily. Go for Redme note 6 pro have better screen.", "Problems with playing videos, especially with YouTube. It takes indefinite time when you click a video to play. Sometimes, it works, sometimes not. It gets stuck when you forward or remind the video", "I don't understand how these guys release phones without doing basic testing.", "I was exicted to see honor 8c at this price point 11999 with good battery hd+ screen and 13mp camera. It has very good power management and the battery lasts easily for over 2 days", "But i was shocked to see the really bad quality of the display and camera. Phones in the price range of 7k have better pictures nad screen quality with the battery. Really bad product from Honor. They should take this device off the shelves or sell it for 7999 with mentioning the camera as 5mp. Yes the camera is definitely 13mp on paper but the output is bery bad. I thought it was just because of the screen but when i check the pics on my laptop they look even worser.", "I am returning the device thankfully amazon did agree to it. I have used honor 9lite and it was fantastic device at 9999. But this honor is utter crap.", "Camera 📸 quality 10/9", "Battery 🔋 life 10/10", "Screen quality 10/9", "Not worth for money", "Poor camera clarity ( front & rear)", "Poor display quality.", "Sound ok.", "Don't buy", "Worst mobile camera quality is very bad its like low mgp"], "description": ["13MP+2MP dual rear primary camera and 8MP front facing camera", "15.90 centimeters (6.26-inch) with 1520 x 720 pixels resolution | 269 ppi pixel density", "Memory, Storage and SIM: 4GB RAM 32GB internal memory expandable up to 256GB | Dual SIM (nano+nano) dual-standby (4G+4G)", "Android v8.1 Oreo EMUI 8.2 Lite operating system with 1.8GHz Snapdragon 632 octa core processor", "4000mAH lithium-polymer battery", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: Charger, USB Cable, Warranty Card, Quick Start Guide, Eject tool and Protective Case"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81HCLSEkRFL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/81HCLSEkRFL._SL1500_.jpg", "path": "full/3c4ac1e97107089f542efcecac57050d316193e7.jpg", "checksum": "349a5a2af2c32aab2e8cf8d4f1a992b8"}]},
{"title": "Honor 9N (Blue, 4GB RAM)", "brand": "Honor", "rating": "3.7 out of 5 stars", "price": "11,999.00", "colour": "Blue", "instock": true, "reviews": ["Except the front camera, there is nothing that is good about the mobile , charge doesn't stay for, the screen is too bad screen touch is bad, 128 gb space but still phone hangs several times, having issues to answer calls, waste of money....", "All in all the phone is a good buy", "Pros:", "Excellent Picture quality,Resolution of mobile is charm with Notch display", "Sound Quality is fine considering location of speaker on device.", "Battery is the only Con for this as due to high resolution display and background app power consumption drainage is quick.", "Overall a good buy !!", "Nice pick under this price range. Finger Print Sensor and Face Unlock Feature are very fast and accurate. Even works in low light. Camera Quality is also very nice. Please go for the product. 5 Star from my side.", "Do not support dual volte active standby. No updates also making this product obsolete. So no point in purchasing as the cheaper ones support that", "phone camera is awesome", "Go on", "Like my dream phone, perfect phone that i was looking about, no cons exept one, and that is battery, it could be more powerful. Overall perfect phone for everyone wants the phone for daily purposes. No major flaws.Stylish look and performance is superb. NO headphone.....", "Like my dream phone, perfect phone that i was looking about, no cons exept one, and that is battery, it could be more powerful. Overall perfect phone for everyone wants the phone for daily purposes. No major flaws"], "description": ["13MP+2MP dual camera and 16MP front facing camera", "14.83 centimeters (5.84-inch) multi-touch capacitive touchscreen with 2280 x 1080 pixels resolution 16M color support", "Memory, Storage & SIM: 4GB RAM | 128GB storage expandable up to 256GB| Dual SIM with dual standby (4G+4G)", "Android v8 Oreo operating system with 2.36GHz + 1.7GHz Kirin 659 octa core processor", "3000mAH lithium-polymer battery", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase", "Box also includes: Charger, USB Cable, Quick Start Guide, Warranty Card, Eject Tool, Protective Case"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/712SXlt3pUL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/712SXlt3pUL._SL1500_.jpg", "path": "full/cdbc9421c673ee2302cdb19f7910a7466ea77d7d.jpg", "checksum": "1fa65e00733f2bfc6765dbcab950f3ee"}]},
{"title": "Honor Play (Navy Blue, 4GB RAM, 64GB Storage)", "brand": "Honor", "rating": "4.4 out of 5 stars", "price": "14,999.00", "colour": "Navy Blue", "instock": true, "reviews": ["Guys, I am in a confusion for about 3 weeks on which phone to buy in the sale season. Poco F1, Honor play, Zenfone 5z and OnePlus 6. These are my shortlists and I first removed op6 because I personally didn't like oneplus because of its overrated specs and camera. SD845 is capable of AI but there is no single feature (thati know of) that used AI in oxygen OS. Then I started reading the official forums of these 3 phones. In Zenfone 5z forums, there are so many people complaining of its bugs and slow updates fixing those bugs. So I removed it next. Then I started thinking extensively on what to buy in between poco F1 and Honor play.", "I started reading Honor play forums first. In all reviews there, I see people are very satisfied with this and there are very very few complaints in the forumsR (may be a in 20). But I am inclined towards towards sd845 of poco. So, I started reading it's forums and there, I have observed so many people complaining of its build quality and display. I am still convinced some how to compromise on these two. And thought of buying it only because of sd845. I kept on reading the forums day to day. And the complaints in the poco forums kept on increasing related to its display. I have seen one complaint related to screen bleeding in poco for which the company said it is a software issue. I didn't understand how far it is true. What I wanted is not give discouraged after investing 20K of my money. So finally I took the call and ordered HONOR PLAY. I believed in the public forums but not YouTube reviews. The forums will never give wrong data as far as I believe.", "5 star for the delivery. I got the order delivered on the very next day. Thanks to Amazon. Now coming to mobile,", "Believe me guys, this is a beast. U will never feel bad for investing ur hard earned 18k on this phone.", "1) the build quality is excellent. It feels very premium in hand.", "2) camera is awesome. The pics that I take from this phone really comes very very gud. U can follow me at @praveen_buddhavarapu in Instagram to see some samples of this camera. U won't believe me if I say the night mode is also very Gud. The entire YouTube has completely gone angry with the nightmode of this phone. But believe me guys this phone's camera is no where less to any flagship camera even in night mode.", "3) the gallery app. This is the most lovely thing in this phone. I have been wondering how apple used face recognition and sorts photos based on faces, places and things. The same is also being done by Honor in this phone. The gallery app sorts and orders the pics based on the location, faces, things. And the next best thing is, it creates videos of the people like how apple does in iOS gallery app.", "4) Histen audio feature. If u wear earphones and listen to some FLAC songs with full volume with the Histen sound mode set to auto, trust me u will feel very much involved in the song and u can definitely forget about the sorroundings (use it at high volume only in ur personal place, but please keep track of us sorroundings in public places)", "4) Display is awesome. I have used a mobile with amoled display previously and I use to feel very indulged when I watch HD videos in it. The fhd display in Honor play is no where inferior to the amoled display and u can find no difference at all in between the two displays.", "5) the massive 3750 mah battery is a great thing in this phone. I don't use dual sim though my previous phones have dual sim support. I always use only one Airtel sim. With single sim, the battery use to stand for 1 and half day completely with normal usage. Always internet was on and screen on time is around 2-3hrs in an average.", "6) EMUI is perfectly blended. No bugs umi identified in my personal usage except one personal suggestion. That is they have to implement the iPhone X kind of gestures as soon as possible in this. Because when we type something, the on screen home button comes exactly down the space button and in speed typing, I sometimes use to hit on the home button instead of space. So this is the only problem is faced in this. Though Honor has confirmed the iPhone X style of gestures in Pie update, I am eagerly waiting for it.", "7) the notification led is placed at the correct position inside the earpiece. I think all the phones should place the led inside the earpiece as it won't take any extra place there. I tested it with blue, white, orange, green  olkurs. But I think it will glow in some other colours as well.", "8) lastly the performance, man this is a beast. I can't say anything more. I have been using this for past one month and I never faced single hiccup with this phone. like the phone was branded, it is very smooth a gaming. I play pubg atleast 3-4 full games per day (mean 1-2 hrs daily) and I never faced any issue like lag or frame drop with this phone. The gaming suite is awesome. It won't show the annoying notifications as notification heads when we are playing any games.", "Finally I can say that this is a phone worth its price and worth my time I spent looking at reviews for this. I first feared that, after buying this phone, i might get a feeling that I didn't buy poco or Zenfone. But I never got such a feelong while using this. I am very much satisfied with this mobile and i'm happy that I didn't buy POCO. I don't know how many issues that I would face if I had bought poco.", "Hope this review helps u to decide on ur phone. Please let me know if u have any questions related to this phone. I am happy to answer.", "I purchased the mobile on last week of October. Everything was fine. The performance was outstanding. The build quality was super, but yesterday my phone explode. Now I know how they implement flagship processor at such a low price tag. I don't think that they use a good quality battery.", "Thankfully I didn't get injuries.", "I don't recomend this phone to buy. Please guys stay away from this phone . Please don't buy this. And those who already purchased this please use this device carefully.", "Finally after one month i am writing my experience about honor play 6 GB varient. it is a good phone with good visual display. i was very confused before buying this product because of so called mobile experts on youtube some youtubers claim that camera is just OK and struggle in low light and BLA BLA but finally i bought this on my own risk and i am happy to buy it.", "1) Camera quality is good and it takes very sharp pictures but those who are expecting DSLR quality please don't buy it", "  because it is a phone which contains camera feature, if you are fond of photography then please buy a DSLR and", "  don't buy any phone for that.", "  People take selfie/ backshot and zoom it and i don't know why they do so and finally complain some noise and all", "  that stuff. Well this phone doesn't contain any professional lance but its camera capture good pictures in low light", "  too.", " 2) Battery backup is fabulous i am getting 3-4 battery backup by using its unique feature ultra battery saving mode.", "  if you are not a phone worm then you may get 3 days battery backup easily. I always put my phone on ultra battery", "  saving mode specially in night and when i don't use my phone.", "3) Gaming is also good on this phone however, i didn't play much because i play game on my PC rather phone but i", "  don't see any lag while playing asphalt 8.", "4) Build quality is solid and it feels like a premium device. i have bought a 6 GB blue color variant which looks great.", "5) i recommend to buy if you are not so much ambitious regarding phones.", "6) Yes it heats up easily while gaming and it is annoying in summer but gamers can ignore this issue.", "Expected better camera performance, expected kirin 970 to be killer in gaming performance but its not upto the mark. can not compare kirin 970 to snapdragon 845 or 835, but i guess at this price point its a good phone. could get better performance with the POCOFONE. No complaints with Look of the phone, it looks beautiful", "Build quality nd design best You feel a premium phone in your hand👌👌", "Picture quality is good only in daylight in night it struggles alot. I'm not telling that it has a worst camera for night. Compare to other device at this price range they have good one .. bt it ok for night too if you not a camera centric person", "Gaming is best in this phone thanks to Kirin 970  nd GPU trubo . You can play pubg in HD mode without any lag .. while playing pubg for 30 min it gets little warm that's nt an issue. If you are a pubg lover go for it.👍", "I saw some YouTube review of this phone some tech gurus complaining about sound quality and low volume don't listen to them , sound quality is best and high volume is sufficient.", "Battery life go for a whole day if you play game for one hour .. if you don't.. it last for one and half day.", "Conclusion .. this the best phone under 20k i got it at 17k"], "description": ["16MP+2MP dual rear camera with scene recognition, support EIS for multi frame stabilization | 16MP front camera", "16.002 centimeters (6.3-inch) with 2340 x 1080 pixels resolution", "Memory, Storage and SIM: 4GB RAM | 64GB internal memory expandable up to 256GB | Dual SIM dual-standby (4G+4G)", "Android Oreo v8.1+EMUI v8.2 operating system with 2.36GHz Kirin 970 AI Chipset octa core processor", "3750mAH lithium-polymer battery", "1 year manufacturer warranty for device and 6 months manufacturer warranty for in-box accessories including batteries from the date of purchase"], "image_urls": ["https://images-na.ssl-images-amazon.com/images/I/81OVt-8o1bL._SL1500_.jpg"], "images": [{"url": "https://images-na.ssl-images-amazon.com/images/I/81OVt-8o1bL._SL1500_.jpg", "path": "full/7cd0a8eb8455e7af459142cc0b6519d4d42440e9.jpg", "checksum": "d1da148dc2056a268351e28ad4e29f28"}]}
]